MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/******************************************************************************
 * HDMI-CEC_MODULE
 ******************************************************************************/
/* HDMI-CEC MODULE registers bit fields */
typedef struct stc_hdmicec_txctrl_field
{
  __IO  uint8_t TXEN       : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t START      : 1;
  __IO  uint8_t EOM        : 1;
  __IO  uint8_t ITSTEN     : 1;
  __IO  uint8_t IBREN      : 1;
} stc_hdmicec_txctrl_field_t;

typedef struct stc_hdmicec_txdata_field
{
  union {
    struct {
      __IO  uint8_t TXDATA     : 8;
    };
    struct {
      __IO  uint8_t TXDATA0    : 1;
      __IO  uint8_t TXDATA1    : 1;
      __IO  uint8_t TXDATA2    : 1;
      __IO  uint8_t TXDATA3    : 1;
      __IO  uint8_t TXDATA4    : 1;
      __IO  uint8_t TXDATA5    : 1;
      __IO  uint8_t TXDATA6    : 1;
      __IO  uint8_t TXDATA7    : 1;
    };
  };
} stc_hdmicec_txdata_field_t;

typedef struct stc_hdmicec_txsts_field
{
  __IO  uint8_t ACKSV      : 1;
        uint8_t RESERVED1  : 3;
  __IO  uint8_t ITST       : 1;
  __IO  uint8_t IBR        : 1;
} stc_hdmicec_txsts_field_t;

typedef struct stc_hdmicec_sfree_field
{
  union {
    struct {
      __IO  uint8_t SFREE      : 4;
            uint8_t RESERVED1  : 4;
    };
    struct {
      __IO  uint8_t SFREE0     : 1;
      __IO  uint8_t SFREE1     : 1;
      __IO  uint8_t SFREE2     : 1;
      __IO  uint8_t SFREE3     : 1;
            uint8_t RESERVED2  : 4;
    };
  };
} stc_hdmicec_sfree_field_t;

typedef struct stc_hdmicec_rcst_field
{
  __IO  uint8_t OVF        : 1;
  __IO  uint8_t EOM        : 1;
  __IO  uint8_t ACK        : 1;
  __IO  uint8_t ST         : 1;
  __IO  uint8_t OVFSEL     : 1;
  __IO  uint8_t OVFIE      : 1;
  __IO  uint8_t ACKIE      : 1;
  __IO  uint8_t STIE       : 1;
} stc_hdmicec_rcst_field_t;

typedef struct stc_hdmicec_rccr_field
{
  __IO  uint8_t EN         : 1;
  __IO  uint8_t MOD        : 2;
  __IO  uint8_t ADRCE      : 1;
        uint8_t RESERVED2  : 3;
  __IO  uint8_t THSEL      : 1;
} stc_hdmicec_rccr_field_t;

typedef struct stc_hdmicec_rcckd_field
{
  union {
    struct {
      __IO uint16_t CKDIV      : 12;
      __IO uint16_t CKSEL      : 1;
           uint16_t RESERVED1  : 3;
    };
    struct {
      __IO uint16_t CKDIV0     : 1;
      __IO uint16_t CKDIV1     : 1;
      __IO uint16_t CKDIV2     : 1;
      __IO uint16_t CKDIV3     : 1;
      __IO uint16_t CKDIV4     : 1;
      __IO uint16_t CKDIV5     : 1;
      __IO uint16_t CKDIV6     : 1;
      __IO uint16_t CKDIV7     : 1;
      __IO uint16_t CKDIV8     : 1;
      __IO uint16_t CKDIV9     : 1;
      __IO uint16_t CKDIV10    : 1;
      __IO uint16_t CKDIV11    : 1;
           uint16_t RESERVED2  : 4;
    };
  };
} stc_hdmicec_rcckd_field_t;

typedef struct stc_hdmicec_rcrc_field
{
  __IO  uint8_t RC         : 1;
        uint8_t RESERVED1  : 3;
  __IO  uint8_t RCIE       : 1;
} stc_hdmicec_rcrc_field_t;

typedef struct stc_hdmicec_rcle_field
{
  __IO  uint8_t LES        : 1;
  __IO  uint8_t LEL        : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t EPE        : 1;
  __IO  uint8_t LESE       : 1;
  __IO  uint8_t LELE       : 1;
  __IO  uint8_t LESIE      : 1;
  __IO  uint8_t LELIE      : 1;
} stc_hdmicec_rcle_field_t;

/******************************************************************************
 * DSTC_MODULE
 ******************************************************************************/
/* DSTC_MODULE register bit fields */
typedef struct stc_dstc_hwdesp_field
{
  __IO uint32_t CHANNEL    : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t HWDESP     : 14;
       uint32_t RESERVED2  : 2;
} stc_dstc_hwdesp_field_t;

typedef struct stc_dstc_cfg_field
{
  __IO uint8_t  SWINTE     : 1;
  __IO uint8_t  ERINTE     : 1;
  __IO uint8_t  RBDIS      : 1;
  __IO uint8_t  ESTE       : 1;
  __IO uint8_t  SWPR       : 3;
       uint8_t  RESERVED   : 1;
} stc_dstc_cfg_field_t;

typedef struct stc_dstc_swtr_field
{
  __IO uint16_t SWDESP     : 14;
  __IO uint16_t SWREQ      : 1;
  __IO uint16_t SWST       : 1;
} stc_dstc_swtr_field_t;

typedef struct stc_dstc_moners_field
{
  __IO uint32_t EST        : 3;
  __IO uint32_t DER        : 1;
  __IO uint32_t ESTOP      : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t EHS        : 1;
  __IO uint32_t RESERVED2  : 1;
  __IO uint32_t ECH        : 8;
  __IO uint32_t EDESP      : 14;
       uint32_t RESERVED3  : 2;
} stc_dstc_moners_field_t;

/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* GPIO_MODULE register bit fields */
typedef struct stc_gpio_pfr0_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
       uint32_t RESERVED1  : 3;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
} stc_gpio_pfr0_field_t;

typedef struct stc_gpio_pfr1_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pfr1_field_t;

typedef struct stc_gpio_pfr2_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
} stc_gpio_pfr2_field_t;

typedef struct stc_gpio_pfr3_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
} stc_gpio_pfr3_field_t;

typedef struct stc_gpio_pfr4_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
} stc_gpio_pfr4_field_t;

typedef struct stc_gpio_pfr5_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pfr5_field_t;

