MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
typedef struct stc_sdif_spwswch_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_spwswch_field_t;

typedef struct stc_sdif_stunsetl_field
{
  __IO uint16_t TNPTSEL   : 8;
  __IO uint16_t TNPHSELEN : 1;
  __IO uint16_t TNERRBDSEL: 1;
  __IO uint16_t RETNTAPSEL: 1;
  __IO uint16_t RETNRNGSEL: 2;
       uint16_t RESERVED1 : 3;
} stc_sdif_stunsetl_field_t;

typedef struct stc_sdif_stunseth_field
{
  __IO uint16_t CMDCFCHKDS: 1;
       uint16_t RESERVED1 : 7;
  __IO uint16_t DTOTCNTVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_stunseth_field_t;

typedef struct stc_sdif_stunstl_field
{
  __IO uint16_t REP8TNRSLT: 8;
  __IO uint16_t REP3TNRSLT: 3;
       uint16_t RESERVED1 : 5;
} stc_sdif_stunstl_field_t;

typedef struct stc_sdif_stunsth_field
{
  __IO uint16_t PRSTTNPNT : 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_stunsth_field_t;

typedef struct stc_sdif_pswistl_field
{
  __IO uint16_t INT5MS    : 1;
  __IO uint16_t INT1MS    : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistl_field_t;

typedef struct stc_sdif_pswisth_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisth_field_t;


typedef struct stc_sdif_pswistel_field
{
  __IO uint16_t INT5MSSTS : 1;
  __IO uint16_t INT1MSSTS : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistel_field_t;

typedef struct stc_sdif_pswisteh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisteh_field_t;

typedef struct stc_sdif_pswisgel_field
{
  __IO uint16_t INT5MSSGEN: 1;
  __IO uint16_t INT1MSSGEN: 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswisgel_field_t;

typedef struct stc_sdif_pswisgeh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisgeh_field_t;

typedef struct stc_sdif_mmcsdcl_field
{
  __IO uint16_t LCKRSTESD : 1;
  __IO uint16_t RSTMMC    : 1;
  __IO uint16_t VCCCTLMMC : 1;
  __IO uint16_t VCCQCTLMMC: 1;
       uint16_t RESERVED1 : 4;
  __IO uint16_t MMCDDRSEL : 1;
  __IO uint16_t CMDDATDLY : 1;
       uint16_t RESERVED2 : 6;
} stc_sdif_mmcsdcl_field_t;

typedef struct stc_sdif_mmcsdch_field
{
  __IO uint16_t BTACKENMMC: 1;
  __IO uint16_t BTABTENMMC: 1;
  __IO uint16_t BTMDENMMC : 1;
       uint16_t RESERVED1 : 13;
} stc_sdif_mmcsdch_field_t;

typedef struct stc_sdif_mcwirqc0_field
{
  __IO uint16_t WTIRQEN   : 1;
  __IO uint16_t WTIRQST   : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_mcwirqc0_field_t;

typedef struct stc_sdif_mcwirqc1_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc1_field_t;

typedef struct stc_sdif_mcwirqc2_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc2_field_t;

typedef struct stc_sdif_mcwirqc3_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc3_field_t;

typedef struct stc_sdif_mcrpckbl_field
{
  __IO uint16_t CHECKBIT1 : 7;
  __IO uint16_t CHECKBIT2 : 6;
       uint16_t RESERVED1 : 3;
} stc_sdif_mcrpckbl_field_t;

typedef struct stc_sdif_mcrpckbh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_mcrpckbh_field_t;

typedef struct stc_sdif_scdetecs_field
{
       uint16_t RESERVED1 : 8;
  __IO uint16_t CDDEBTCVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_scdetecs_field_t;

/******************************************************************************
 * CANFD_MODULE
 ******************************************************************************/
/* CANFD_MODULE register bit fields */
typedef struct stc_canfd_crel_field
{
  __IO uint32_t DAY        : 8;
  __IO uint32_t MON        : 8;
  __IO uint32_t YEAR       : 4;
  __IO uint32_t SUBSTEP    : 4;
  __IO uint32_t STEP       : 4;
  __IO uint32_t REL        : 4;
} stc_canfd_crel_field_t;

typedef struct stc_canfd_endn_field
{
  __IO uint32_t ETV        : 32;
} stc_canfd_endn_field_t;

typedef struct stc_canfd_fbtp_field
{
  __IO uint32_t FSJW       : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FTSEG2     : 3;
       uint32_t RESERVED2  : 1;
  __IO uint32_t FTSEG1     : 4;
       uint32_t RESERVED3  : 4;
  __IO uint32_t FBRP       : 5;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TDC        : 1;
  __IO uint32_t TDCO       : 5;
} stc_canfd_fbtp_field_t;

typedef struct stc_canfd_test_field
{
       uint32_t RESERVED1  : 4;
  __IO uint32_t LBCK       : 1;
  __IO uint32_t TX         : 2;
  __IO uint32_t RX         : 1;
  __IO uint32_t TDCV       : 6;
} stc_canfd_test_field_t;

typedef struct stc_canfd_rwd_field
{
  __IO uint32_t WDC        : 8;
  __IO uint32_t WDV        : 8;
} stc_canfd_rwd_field_t;

typedef struct stc_canfd_cccr_field
{
  __IO uint32_t INIT       : 1;
  __IO uint32_t CCE        : 1;
  __IO uint32_t ASM        : 1;
  __IO uint32_t CSA        : 1;
  __IO uint32_t CSR        : 1;
  __IO uint32_t MON        : 1;
  __IO uint32_t DAR        : 1;
  __IO uint32_t TEST       : 1;
  __IO uint32_t CME        : 2;
  __IO uint32_t CMR        : 2;
  __IO uint32_t FDO        : 1;
  __IO uint32_t FDBS       : 1;
  __IO uint32_t TXP        : 1;
} stc_canfd_cccr_field_t;

typedef struct stc_canfd_btp_field
{
  __IO uint32_t SJW        : 4;
  __IO uint32_t TSEG2      : 4;
  __IO uint32_t TSEG1      : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t BRP        : 10;
} stc_canfd_btp_field_t;

typedef struct stc_canfd_tscc_field
{
  __IO uint32_t TSS        : 2;
       uint32_t RESERVED1  : 14;
  __IO uint32_t TCP        : 4;
} stc_canfd_tscc_field_t;

typedef struct stc_canfd_tscv_field
{
  __IO uint32_t TSC        : 16;
} stc_canfd_tscv_field_t;

typedef struct stc_canfd_tocc_field
{
  __IO uint32_t ETOC       : 1;
  __IO uint32_t TOS        : 2;
       uint32_t RESERVED1  : 13;
  __IO uint32_t TOP        : 16;
} stc_canfd_tocc_field_t;

typedef struct stc_canfd_tocv_field
{
  __IO uint32_t TOC        : 16;
} stc_canfd_tocv_field_t;

typedef struct stc_canfd_ecr_field
{
  __IO uint32_t TEC        : 8;
  __IO uint32_t REC        : 7;
  __IO uint32_t RP         : 1;
  __IO uint32_t CEL        : 8;
} stc_canfd_ecr_field_t;

typedef struct stc_canfd_psr_field
{
  __IO uint32_t LEC        : 3;
  __IO uint32_t ACT        : 2;
  __IO uint32_t EP         : 1;
  __IO uint32_t EW         : 1;
  __IO uint32_t BO         : 1;
  __IO uint32_t FLEC       : 3;
  __IO uint32_t RESI       : 1;
  __IO uint32_t RBRS       : 1;
  __IO uint32_t REDL       : 1;
} stc_canfd_psr_field_t;

