MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT0_WFG_WFSA10_DCK0              *((volatile unsigned char*)(0x42403480UL))
#define bFM4_MFT0_WFG_WFSA10_DCK1              *((volatile unsigned char*)(0x42403484UL))
#define bFM4_MFT0_WFG_WFSA10_DCK2              *((volatile unsigned char*)(0x42403488UL))
#define bFM4_MFT0_WFG_WFSA10_GTEN0             *((volatile unsigned char*)(0x42403498UL))
#define bFM4_MFT0_WFG_WFSA10_GTEN1             *((volatile unsigned char*)(0x4240349CUL))
#define bFM4_MFT0_WFG_WFSA10_PSEL0             *((volatile unsigned char*)(0x424034A0UL))
#define bFM4_MFT0_WFG_WFSA10_PSEL1             *((volatile unsigned char*)(0x424034A4UL))
#define bFM4_MFT0_WFG_WFSA10_PGEN0             *((volatile unsigned char*)(0x424034A8UL))
#define bFM4_MFT0_WFG_WFSA10_PGEN1             *((volatile unsigned char*)(0x424034ACUL))
#define bFM4_MFT0_WFG_WFSA32_DCK0              *((volatile unsigned char*)(0x42403500UL))
#define bFM4_MFT0_WFG_WFSA32_DCK1              *((volatile unsigned char*)(0x42403504UL))
#define bFM4_MFT0_WFG_WFSA32_DCK2              *((volatile unsigned char*)(0x42403508UL))
#define bFM4_MFT0_WFG_WFSA32_GTEN0             *((volatile unsigned char*)(0x42403518UL))
#define bFM4_MFT0_WFG_WFSA32_GTEN1             *((volatile unsigned char*)(0x4240351CUL))
#define bFM4_MFT0_WFG_WFSA32_PSEL0             *((volatile unsigned char*)(0x42403520UL))
#define bFM4_MFT0_WFG_WFSA32_PSEL1             *((volatile unsigned char*)(0x42403524UL))
#define bFM4_MFT0_WFG_WFSA32_PGEN0             *((volatile unsigned char*)(0x42403528UL))
#define bFM4_MFT0_WFG_WFSA32_PGEN1             *((volatile unsigned char*)(0x4240352CUL))
#define bFM4_MFT0_WFG_WFSA54_DCK0              *((volatile unsigned char*)(0x42403580UL))
#define bFM4_MFT0_WFG_WFSA54_DCK1              *((volatile unsigned char*)(0x42403584UL))
#define bFM4_MFT0_WFG_WFSA54_DCK2              *((volatile unsigned char*)(0x42403588UL))
#define bFM4_MFT0_WFG_WFSA54_GTEN0             *((volatile unsigned char*)(0x42403598UL))
#define bFM4_MFT0_WFG_WFSA54_GTEN1             *((volatile unsigned char*)(0x4240359CUL))
#define bFM4_MFT0_WFG_WFSA54_PSEL0             *((volatile unsigned char*)(0x424035A0UL))
#define bFM4_MFT0_WFG_WFSA54_PSEL1             *((volatile unsigned char*)(0x424035A4UL))
#define bFM4_MFT0_WFG_WFSA54_PGEN0             *((volatile unsigned char*)(0x424035A8UL))
#define bFM4_MFT0_WFG_WFSA54_PGEN1             *((volatile unsigned char*)(0x424035ACUL))
#define bFM4_MFT0_WFG_WFIR_DTIFA               *((volatile unsigned char*)(0x42403600UL))
#define bFM4_MFT0_WFG_WFIR_DTICA               *((volatile unsigned char*)(0x42403604UL))
#define bFM4_MFT0_WFG_WFIR_DTIFB               *((volatile unsigned char*)(0x42403608UL))
#define bFM4_MFT0_WFG_WFIR_DTICB               *((volatile unsigned char*)(0x4240360CUL))
#define bFM4_MFT0_WFG_WFIR_TMIF10              *((volatile unsigned char*)(0x42403610UL))
#define bFM4_MFT0_WFG_WFIR_TMIC10              *((volatile unsigned char*)(0x42403614UL))
#define bFM4_MFT0_WFG_WFIR_TMIE10              *((volatile unsigned char*)(0x42403618UL))
#define bFM4_MFT0_WFG_WFIR_TMIS10              *((volatile unsigned char*)(0x4240361CUL))
#define bFM4_MFT0_WFG_WFIR_TMIF32              *((volatile unsigned char*)(0x42403620UL))
#define bFM4_MFT0_WFG_WFIR_TMIC32              *((volatile unsigned char*)(0x42403624UL))
#define bFM4_MFT0_WFG_WFIR_TMIE32              *((volatile unsigned char*)(0x42403628UL))
#define bFM4_MFT0_WFG_WFIR_TMIS32              *((volatile unsigned char*)(0x4240362CUL))
#define bFM4_MFT0_WFG_WFIR_TMIF54              *((volatile unsigned char*)(0x42403630UL))
#define bFM4_MFT0_WFG_WFIR_TMIC54              *((volatile unsigned char*)(0x42403634UL))
#define bFM4_MFT0_WFG_WFIR_TMIE54              *((volatile unsigned char*)(0x42403638UL))
#define bFM4_MFT0_WFG_WFIR_TMIS54              *((volatile unsigned char*)(0x4240363CUL))
#define bFM4_MFT0_WFG_NZCL_DTIEA               *((volatile unsigned char*)(0x42403680UL))
#define bFM4_MFT0_WFG_NZCL_NWS0                *((volatile unsigned char*)(0x42403684UL))
#define bFM4_MFT0_WFG_NZCL_NWS1                *((volatile unsigned char*)(0x42403688UL))
#define bFM4_MFT0_WFG_NZCL_NWS2                *((volatile unsigned char*)(0x4240368CUL))
#define bFM4_MFT0_WFG_NZCL_SDTI                *((volatile unsigned char*)(0x42403690UL))
#define bFM4_MFT0_WFG_NZCL_DTIEB               *((volatile unsigned char*)(0x42403694UL))
#define bFM4_MFT0_WFG_NZCL_DHOLD               *((volatile unsigned char*)(0x4240369CUL))
#define bFM4_MFT0_WFG_NZCL_DIMA                *((volatile unsigned char*)(0x424036A0UL))
#define bFM4_MFT0_WFG_NZCL_DIMB                *((volatile unsigned char*)(0x424036A4UL))
#define bFM4_MFT0_WFG_NZCL_WIM10               *((volatile unsigned char*)(0x424036B0UL))
#define bFM4_MFT0_WFG_NZCL_WIM32               *((volatile unsigned char*)(0x424036B4UL))
#define bFM4_MFT0_WFG_NZCL_WIM54               *((volatile unsigned char*)(0x424036B8UL))

/* Multifunction Timer unit 0 Input Capture Unit registers */
#define bFM4_MFT0_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42402D80UL))
#define bFM4_MFT0_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42402D84UL))
#define bFM4_MFT0_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42402D88UL))
#define bFM4_MFT0_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42402D8CUL))
#define bFM4_MFT0_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42402D90UL))
#define bFM4_MFT0_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42402D94UL))
#define bFM4_MFT0_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42402D98UL))
#define bFM4_MFT0_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42402D9CUL))
#define bFM4_MFT0_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42402DA0UL))
#define bFM4_MFT0_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42402DA4UL))
#define bFM4_MFT0_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42402DA8UL))
#define bFM4_MFT0_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42402DACUL))
#define bFM4_MFT0_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42402DB0UL))
#define bFM4_MFT0_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42402DB4UL))
#define bFM4_MFT0_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42402DB8UL))
#define bFM4_MFT0_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42402DBCUL))
#define bFM4_MFT0_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42403080UL))
#define bFM4_MFT0_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42403084UL))
#define bFM4_MFT0_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42403088UL))
#define bFM4_MFT0_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4240308CUL))
#define bFM4_MFT0_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42403090UL))
#define bFM4_MFT0_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42403094UL))
#define bFM4_MFT0_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42403098UL))
#define bFM4_MFT0_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4240309CUL))
#define bFM4_MFT0_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424030A0UL))
#define bFM4_MFT0_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424030A4UL))
#define bFM4_MFT0_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42403100UL))
#define bFM4_MFT0_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42403104UL))
#define bFM4_MFT0_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42403108UL))
#define bFM4_MFT0_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4240310CUL))
#define bFM4_MFT0_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42403110UL))
#define bFM4_MFT0_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42403114UL))
#define bFM4_MFT0_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42403118UL))
#define bFM4_MFT0_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4240311CUL))
#define bFM4_MFT0_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42403120UL))
#define bFM4_MFT0_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42403124UL))

/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
#define bFM4_MFT0_ADCMP_ACSC0_BUFE0            *((volatile unsigned char*)(0x42403A80UL))
#define bFM4_MFT0_ADCMP_ACSC0_BUFE1            *((volatile unsigned char*)(0x42403A84UL))
#define bFM4_MFT0_ADCMP_ACSC0_ADSEL0           *((volatile unsigned char*)(0x42403A88UL))
#define bFM4_MFT0_ADCMP_ACSC0_ADSEL1           *((volatile unsigned char*)(0x42403A8CUL))
#define bFM4_MFT0_ADCMP_ACSC0_ADSEL2           *((volatile unsigned char*)(0x42403A90UL))
#define bFM4_MFT0_ADCMP_ACSC0_APBM             *((volatile unsigned char*)(0x42403A94UL))
#define bFM4_MFT0_ADCMP_ACSD0_AMOD             *((volatile unsigned char*)(0x42403AA0UL))
#define bFM4_MFT0_ADCMP_ACSD0_OCUS             *((volatile unsigned char*)(0x42403AA4UL))
#define bFM4_MFT0_ADCMP_ACSD0_DE               *((volatile unsigned char*)(0x42403AB0UL))
#define bFM4_MFT0_ADCMP_ACSD0_PE               *((volatile unsigned char*)(0x42403AB4UL))
#define bFM4_MFT0_ADCMP_ACSD0_UE               *((volatile unsigned char*)(0x42403AB8UL))
#define bFM4_MFT0_ADCMP_ACSD0_ZE               *((volatile unsigned char*)(0x42403ABCUL))
#define bFM4_MFT0_ADCMP_ACMC0_AMC0             *((volatile unsigned char*)(0x42403AC0UL))
#define bFM4_MFT0_ADCMP_ACMC0_AMC1             *((volatile unsigned char*)(0x42403AC4UL))
#define bFM4_MFT0_ADCMP_ACMC0_AMC2             *((volatile unsigned char*)(0x42403AC8UL))
#define bFM4_MFT0_ADCMP_ACMC0_AMC3             *((volatile unsigned char*)(0x42403ACCUL))
#define bFM4_MFT0_ADCMP_ACMC0_MZCE             *((volatile unsigned char*)(0x42403AD8UL))
#define bFM4_MFT0_ADCMP_ACMC0_MPCE             *((volatile unsigned char*)(0x42403ADCUL))
#define bFM4_MFT0_ADCMP_ACSC1_BUFE0            *((volatile unsigned char*)(0x42403B00UL))
#define bFM4_MFT0_ADCMP_ACSC1_BUFE1            *((volatile unsigned char*)(0x42403B04UL))
#define bFM4_MFT0_ADCMP_ACSC1_ADSEL0           *((volatile unsigned char*)(0x42403B08UL))
#define bFM4_MFT0_ADCMP_ACSC1_ADSEL1           *((volatile unsigned char*)(0x42403B0CUL))
#define bFM4_MFT0_ADCMP_ACSC1_ADSEL2           *((volatile unsigned char*)(0x42403B10UL))
#define bFM4_MFT0_ADCMP_ACSC1_APBM             *((volatile unsigned char*)(0x42403B14UL))
#define bFM4_MFT0_ADCMP_ACSD1_AMOD             *((volatile unsigned char*)(0x42403B20UL))
#define bFM4_MFT0_ADCMP_ACSD1_OCUS             *((volatile unsigned char*)(0x42403B24UL))
#define bFM4_MFT0_ADCMP_ACSD1_DE               *((volatile unsigned char*)(0x42403B30UL))
#define bFM4_MFT0_ADCMP_ACSD1_PE               *((volatile unsigned char*)(0x42403B34UL))
#define bFM4_MFT0_ADCMP_ACSD1_UE               *((volatile unsigned char*)(0x42403B38UL))
#define bFM4_MFT0_ADCMP_ACSD1_ZE               *((volatile unsigned char*)(0x42403B3CUL))
#define bFM4_MFT0_ADCMP_ACMC1_AMC0             *((volatile unsigned char*)(0x42403B40UL))
#define bFM4_MFT0_ADCMP_ACMC1_AMC1             *((volatile unsigned char*)(0x42403B44UL))
#define bFM4_MFT0_ADCMP_ACMC1_AMC2             *((volatile unsigned char*)(0x42403B48UL))
#define bFM4_MFT0_ADCMP_ACMC1_AMC3             *((volatile unsigned char*)(0x42403B4CUL))
#define bFM4_MFT0_ADCMP_ACMC1_MZCE             *((volatile unsigned char*)(0x42403B58UL))
#define bFM4_MFT0_ADCMP_ACMC1_MPCE             *((volatile unsigned char*)(0x42403B5CUL))
#define bFM4_MFT0_ADCMP_ACSC2_BUFE0            *((volatile unsigned char*)(0x42403B80UL))
#define bFM4_MFT0_ADCMP_ACSC2_BUFE1            *((volatile unsigned char*)(0x42403B84UL))
#define bFM4_MFT0_ADCMP_ACSC2_ADSEL0           *((volatile unsigned char*)(0x42403B88UL))
#define bFM4_MFT0_ADCMP_ACSC2_ADSEL1           *((volatile unsigned char*)(0x42403B8CUL))
#define bFM4_MFT0_ADCMP_ACSC2_ADSEL2           *((volatile unsigned char*)(0x42403B90UL))
#define bFM4_MFT0_ADCMP_ACSC2_APBM             *((volatile unsigned char*)(0x42403B94UL))
#define bFM4_MFT0_ADCMP_ACSD2_AMOD             *((volatile unsigned char*)(0x42403BA0UL))
#define bFM4_MFT0_ADCMP_ACSD2_OCUS             *((volatile unsigned char*)(0x42403BA4UL))
#define bFM4_MFT0_ADCMP_ACSD2_DE               *((volatile unsigned char*)(0x42403BB0UL))
#define bFM4_MFT0_ADCMP_ACSD2_PE               *((volatile unsigned char*)(0x42403BB4UL))
#define bFM4_MFT0_ADCMP_ACSD2_UE               *((volatile unsigned char*)(0x42403BB8UL))
#define bFM4_MFT0_ADCMP_ACSD2_ZE               *((volatile unsigned char*)(0x42403BBCUL))
#define bFM4_MFT0_ADCMP_ACMC2_AMC0             *((volatile unsigned char*)(0x42403BC0UL))
#define bFM4_MFT0_ADCMP_ACMC2_AMC1             *((volatile unsigned char*)(0x42403BC4UL))
#define bFM4_MFT0_ADCMP_ACMC2_AMC2             *((volatile unsigned char*)(0x42403BC8UL))
#define bFM4_MFT0_ADCMP_ACMC2_AMC3             *((volatile unsigned char*)(0x42403BCCUL))
#define bFM4_MFT0_ADCMP_ACMC2_MZCE             *((volatile unsigned char*)(0x42403BD8UL))
#define bFM4_MFT0_ADCMP_ACMC2_MPCE             *((volatile unsigned char*)(0x42403BDCUL))
#define bFM4_MFT0_ADCMP_ACSC3_BUFE0            *((volatile unsigned char*)(0x42403C00UL))
#define bFM4_MFT0_ADCMP_ACSC3_BUFE1            *((volatile unsigned char*)(0x42403C04UL))
#define bFM4_MFT0_ADCMP_ACSC3_ADSEL0           *((volatile unsigned char*)(0x42403C08UL))
#define bFM4_MFT0_ADCMP_ACSC3_ADSEL1           *((volatile unsigned char*)(0x42403C0CUL))
#define bFM4_MFT0_ADCMP_ACSC3_ADSEL2           *((volatile unsigned char*)(0x42403C10UL))
#define bFM4_MFT0_ADCMP_ACSC3_APBM             *((volatile unsigned char*)(0x42403C14UL))
#define bFM4_MFT0_ADCMP_ACSD3_AMOD             *((volatile unsigned char*)(0x42403C20UL))
#define bFM4_MFT0_ADCMP_ACSD3_OCUS             *((volatile unsigned char*)(0x42403C24UL))
#define bFM4_MFT0_ADCMP_ACSD3_DE               *((volatile unsigned char*)(0x42403C30UL))
#define bFM4_MFT0_ADCMP_ACSD3_PE               *((volatile unsigned char*)(0x42403C34UL))
#define bFM4_MFT0_ADCMP_ACSD3_UE               *((volatile unsigned char*)(0x42403C38UL))
#define bFM4_MFT0_ADCMP_ACSD3_ZE               *((volatile unsigned char*)(0x42403C3CUL))
#define bFM4_MFT0_ADCMP_ACMC3_AMC0             *((volatile unsigned char*)(0x42403C40UL))
#define bFM4_MFT0_ADCMP_ACMC3_AMC1             *((volatile unsigned char*)(0x42403C44UL))
#define bFM4_MFT0_ADCMP_ACMC3_AMC2             *((volatile unsigned char*)(0x42403C48UL))
#define bFM4_MFT0_ADCMP_ACMC3_AMC3             *((volatile unsigned char*)(0x42403C4CUL))
#define bFM4_MFT0_ADCMP_ACMC3_MZCE             *((volatile unsigned char*)(0x42403C58UL))
#define bFM4_MFT0_ADCMP_ACMC3_MPCE             *((volatile unsigned char*)(0x42403C5CUL))
#define bFM4_MFT0_ADCMP_ACSC4_BUFE0            *((volatile unsigned char*)(0x42403C80UL))
#define bFM4_MFT0_ADCMP_ACSC4_BUFE1            *((volatile unsigned char*)(0x42403C84UL))
#define bFM4_MFT0_ADCMP_ACSC4_ADSEL0           *((volatile unsigned char*)(0x42403C88UL))
#define bFM4_MFT0_ADCMP_ACSC4_ADSEL1           *((volatile unsigned char*)(0x42403C8CUL))
#define bFM4_MFT0_ADCMP_ACSC4_ADSEL2           *((volatile unsigned char*)(0x42403C90UL))
#define bFM4_MFT0_ADCMP_ACSC4_APBM             *((volatile unsigned char*)(0x42403C94UL))
#define bFM4_MFT0_ADCMP_ACSD4_AMOD             *((volatile unsigned char*)(0x42403CA0UL))
#define bFM4_MFT0_ADCMP_ACSD4_OCUS             *((volatile unsigned char*)(0x42403CA4UL))
#define bFM4_MFT0_ADCMP_ACSD4_DE               *((volatile unsigned char*)(0x42403CB0UL))
#define bFM4_MFT0_ADCMP_ACSD4_PE               *((volatile unsigned char*)(0x42403CB4UL))
#define bFM4_MFT0_ADCMP_ACSD4_UE               *((volatile unsigned char*)(0x42403CB8UL))
#define bFM4_MFT0_ADCMP_ACSD4_ZE               *((volatile unsigned char*)(0x42403CBCUL))
#define bFM4_MFT0_ADCMP_ACMC4_AMC0             *((volatile unsigned char*)(0x42403CC0UL))
#define bFM4_MFT0_ADCMP_ACMC4_AMC1             *((volatile unsigned char*)(0x42403CC4UL))
#define bFM4_MFT0_ADCMP_ACMC4_AMC2             *((volatile unsigned char*)(0x42403CC8UL))
#define bFM4_MFT0_ADCMP_ACMC4_AMC3             *((volatile unsigned char*)(0x42403CCCUL))
#define bFM4_MFT0_ADCMP_ACMC4_MZCE             *((volatile unsigned char*)(0x42403CD8UL))
#define bFM4_MFT0_ADCMP_ACMC4_MPCE             *((volatile unsigned char*)(0x42403CDCUL))
#define bFM4_MFT0_ADCMP_ACSC5_BUFE0            *((volatile unsigned char*)(0x42403D00UL))
#define bFM4_MFT0_ADCMP_ACSC5_BUFE1            *((volatile unsigned char*)(0x42403D04UL))
#define bFM4_MFT0_ADCMP_ACSC5_ADSEL0           *((volatile unsigned char*)(0x42403D08UL))
#define bFM4_MFT0_ADCMP_ACSC5_ADSEL1           *((volatile unsigned char*)(0x42403D0CUL))
#define bFM4_MFT0_ADCMP_ACSC5_ADSEL2           *((volatile unsigned char*)(0x42403D10UL))
#define bFM4_MFT0_ADCMP_ACSC5_APBM             *((volatile unsigned char*)(0x42403D14UL))
#define bFM4_MFT0_ADCMP_ACSD5_AMOD             *((volatile unsigned char*)(0x42403D20UL))
#define bFM4_MFT0_ADCMP_ACSD5_OCUS             *((volatile unsigned char*)(0x42403D24UL))
#define bFM4_MFT0_ADCMP_ACSD5_DE               *((volatile unsigned char*)(0x42403D30UL))
#define bFM4_MFT0_ADCMP_ACSD5_PE               *((volatile unsigned char*)(0x42403D34UL))
#define bFM4_MFT0_ADCMP_ACSD5_UE               *((volatile unsigned char*)(0x42403D38UL))
#define bFM4_MFT0_ADCMP_ACSD5_ZE               *((volatile unsigned char*)(0x42403D3CUL))
#define bFM4_MFT0_ADCMP_ACMC5_AMC0             *((volatile unsigned char*)(0x42403D40UL))
#define bFM4_MFT0_ADCMP_ACMC5_AMC1             *((volatile unsigned char*)(0x42403D44UL))
#define bFM4_MFT0_ADCMP_ACMC5_AMC2             *((volatile unsigned char*)(0x42403D48UL))
#define bFM4_MFT0_ADCMP_ACMC5_AMC3             *((volatile unsigned char*)(0x42403D4CUL))
#define bFM4_MFT0_ADCMP_ACMC5_MZCE             *((volatile unsigned char*)(0x42403D58UL))
#define bFM4_MFT0_ADCMP_ACMC5_MPCE             *((volatile unsigned char*)(0x42403D5CUL))

