MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* Multifunction Timer unit 2 ADC Start Compare Unit registers */
#define bFM4_MFT2_ADCMP_ACSC0_BUFE0            *((volatile unsigned char*)(0x42443A80UL))
#define bFM4_MFT2_ADCMP_ACSC0_BUFE1            *((volatile unsigned char*)(0x42443A84UL))
#define bFM4_MFT2_ADCMP_ACSC0_ADSEL0           *((volatile unsigned char*)(0x42443A88UL))
#define bFM4_MFT2_ADCMP_ACSC0_ADSEL1           *((volatile unsigned char*)(0x42443A8CUL))
#define bFM4_MFT2_ADCMP_ACSC0_ADSEL2           *((volatile unsigned char*)(0x42443A90UL))
#define bFM4_MFT2_ADCMP_ACSC0_APBM             *((volatile unsigned char*)(0x42443A94UL))
#define bFM4_MFT2_ADCMP_ACSD0_AMOD             *((volatile unsigned char*)(0x42443AA0UL))
#define bFM4_MFT2_ADCMP_ACSD0_OCUS             *((volatile unsigned char*)(0x42443AA4UL))
#define bFM4_MFT2_ADCMP_ACSD0_DE               *((volatile unsigned char*)(0x42443AB0UL))
#define bFM4_MFT2_ADCMP_ACSD0_PE               *((volatile unsigned char*)(0x42443AB4UL))
#define bFM4_MFT2_ADCMP_ACSD0_UE               *((volatile unsigned char*)(0x42443AB8UL))
#define bFM4_MFT2_ADCMP_ACSD0_ZE               *((volatile unsigned char*)(0x42443ABCUL))
#define bFM4_MFT2_ADCMP_ACMC0_AMC0             *((volatile unsigned char*)(0x42443AC0UL))
#define bFM4_MFT2_ADCMP_ACMC0_AMC1             *((volatile unsigned char*)(0x42443AC4UL))
#define bFM4_MFT2_ADCMP_ACMC0_AMC2             *((volatile unsigned char*)(0x42443AC8UL))
#define bFM4_MFT2_ADCMP_ACMC0_AMC3             *((volatile unsigned char*)(0x42443ACCUL))
#define bFM4_MFT2_ADCMP_ACMC0_MZCE             *((volatile unsigned char*)(0x42443AD8UL))
#define bFM4_MFT2_ADCMP_ACMC0_MPCE             *((volatile unsigned char*)(0x42443ADCUL))
#define bFM4_MFT2_ADCMP_ACSC1_BUFE0            *((volatile unsigned char*)(0x42443B00UL))
#define bFM4_MFT2_ADCMP_ACSC1_BUFE1            *((volatile unsigned char*)(0x42443B04UL))
#define bFM4_MFT2_ADCMP_ACSC1_ADSEL0           *((volatile unsigned char*)(0x42443B08UL))
#define bFM4_MFT2_ADCMP_ACSC1_ADSEL1           *((volatile unsigned char*)(0x42443B0CUL))
#define bFM4_MFT2_ADCMP_ACSC1_ADSEL2           *((volatile unsigned char*)(0x42443B10UL))
#define bFM4_MFT2_ADCMP_ACSC1_APBM             *((volatile unsigned char*)(0x42443B14UL))
#define bFM4_MFT2_ADCMP_ACSD1_AMOD             *((volatile unsigned char*)(0x42443B20UL))
#define bFM4_MFT2_ADCMP_ACSD1_OCUS             *((volatile unsigned char*)(0x42443B24UL))
#define bFM4_MFT2_ADCMP_ACSD1_DE               *((volatile unsigned char*)(0x42443B30UL))
#define bFM4_MFT2_ADCMP_ACSD1_PE               *((volatile unsigned char*)(0x42443B34UL))
#define bFM4_MFT2_ADCMP_ACSD1_UE               *((volatile unsigned char*)(0x42443B38UL))
#define bFM4_MFT2_ADCMP_ACSD1_ZE               *((volatile unsigned char*)(0x42443B3CUL))
#define bFM4_MFT2_ADCMP_ACMC1_AMC0             *((volatile unsigned char*)(0x42443B40UL))
#define bFM4_MFT2_ADCMP_ACMC1_AMC1             *((volatile unsigned char*)(0x42443B44UL))
#define bFM4_MFT2_ADCMP_ACMC1_AMC2             *((volatile unsigned char*)(0x42443B48UL))
#define bFM4_MFT2_ADCMP_ACMC1_AMC3             *((volatile unsigned char*)(0x42443B4CUL))
#define bFM4_MFT2_ADCMP_ACMC1_MZCE             *((volatile unsigned char*)(0x42443B58UL))
#define bFM4_MFT2_ADCMP_ACMC1_MPCE             *((volatile unsigned char*)(0x42443B5CUL))
#define bFM4_MFT2_ADCMP_ACSC2_BUFE0            *((volatile unsigned char*)(0x42443B80UL))
#define bFM4_MFT2_ADCMP_ACSC2_BUFE1            *((volatile unsigned char*)(0x42443B84UL))
#define bFM4_MFT2_ADCMP_ACSC2_ADSEL0           *((volatile unsigned char*)(0x42443B88UL))
#define bFM4_MFT2_ADCMP_ACSC2_ADSEL1           *((volatile unsigned char*)(0x42443B8CUL))
#define bFM4_MFT2_ADCMP_ACSC2_ADSEL2           *((volatile unsigned char*)(0x42443B90UL))
#define bFM4_MFT2_ADCMP_ACSC2_APBM             *((volatile unsigned char*)(0x42443B94UL))
#define bFM4_MFT2_ADCMP_ACSD2_AMOD             *((volatile unsigned char*)(0x42443BA0UL))
#define bFM4_MFT2_ADCMP_ACSD2_OCUS             *((volatile unsigned char*)(0x42443BA4UL))
#define bFM4_MFT2_ADCMP_ACSD2_DE               *((volatile unsigned char*)(0x42443BB0UL))
#define bFM4_MFT2_ADCMP_ACSD2_PE               *((volatile unsigned char*)(0x42443BB4UL))
#define bFM4_MFT2_ADCMP_ACSD2_UE               *((volatile unsigned char*)(0x42443BB8UL))
#define bFM4_MFT2_ADCMP_ACSD2_ZE               *((volatile unsigned char*)(0x42443BBCUL))
#define bFM4_MFT2_ADCMP_ACMC2_AMC0             *((volatile unsigned char*)(0x42443BC0UL))
#define bFM4_MFT2_ADCMP_ACMC2_AMC1             *((volatile unsigned char*)(0x42443BC4UL))
#define bFM4_MFT2_ADCMP_ACMC2_AMC2             *((volatile unsigned char*)(0x42443BC8UL))
#define bFM4_MFT2_ADCMP_ACMC2_AMC3             *((volatile unsigned char*)(0x42443BCCUL))
#define bFM4_MFT2_ADCMP_ACMC2_MZCE             *((volatile unsigned char*)(0x42443BD8UL))
#define bFM4_MFT2_ADCMP_ACMC2_MPCE             *((volatile unsigned char*)(0x42443BDCUL))
#define bFM4_MFT2_ADCMP_ACSC3_BUFE0            *((volatile unsigned char*)(0x42443C00UL))
#define bFM4_MFT2_ADCMP_ACSC3_BUFE1            *((volatile unsigned char*)(0x42443C04UL))
#define bFM4_MFT2_ADCMP_ACSC3_ADSEL0           *((volatile unsigned char*)(0x42443C08UL))
#define bFM4_MFT2_ADCMP_ACSC3_ADSEL1           *((volatile unsigned char*)(0x42443C0CUL))
#define bFM4_MFT2_ADCMP_ACSC3_ADSEL2           *((volatile unsigned char*)(0x42443C10UL))
#define bFM4_MFT2_ADCMP_ACSC3_APBM             *((volatile unsigned char*)(0x42443C14UL))
#define bFM4_MFT2_ADCMP_ACSD3_AMOD             *((volatile unsigned char*)(0x42443C20UL))
#define bFM4_MFT2_ADCMP_ACSD3_OCUS             *((volatile unsigned char*)(0x42443C24UL))
#define bFM4_MFT2_ADCMP_ACSD3_DE               *((volatile unsigned char*)(0x42443C30UL))
#define bFM4_MFT2_ADCMP_ACSD3_PE               *((volatile unsigned char*)(0x42443C34UL))
#define bFM4_MFT2_ADCMP_ACSD3_UE               *((volatile unsigned char*)(0x42443C38UL))
#define bFM4_MFT2_ADCMP_ACSD3_ZE               *((volatile unsigned char*)(0x42443C3CUL))
#define bFM4_MFT2_ADCMP_ACMC3_AMC0             *((volatile unsigned char*)(0x42443C40UL))
#define bFM4_MFT2_ADCMP_ACMC3_AMC1             *((volatile unsigned char*)(0x42443C44UL))
#define bFM4_MFT2_ADCMP_ACMC3_AMC2             *((volatile unsigned char*)(0x42443C48UL))
#define bFM4_MFT2_ADCMP_ACMC3_AMC3             *((volatile unsigned char*)(0x42443C4CUL))
#define bFM4_MFT2_ADCMP_ACMC3_MZCE             *((volatile unsigned char*)(0x42443C58UL))
#define bFM4_MFT2_ADCMP_ACMC3_MPCE             *((volatile unsigned char*)(0x42443C5CUL))
#define bFM4_MFT2_ADCMP_ACSC4_BUFE0            *((volatile unsigned char*)(0x42443C80UL))
#define bFM4_MFT2_ADCMP_ACSC4_BUFE1            *((volatile unsigned char*)(0x42443C84UL))
#define bFM4_MFT2_ADCMP_ACSC4_ADSEL0           *((volatile unsigned char*)(0x42443C88UL))
#define bFM4_MFT2_ADCMP_ACSC4_ADSEL1           *((volatile unsigned char*)(0x42443C8CUL))
#define bFM4_MFT2_ADCMP_ACSC4_ADSEL2           *((volatile unsigned char*)(0x42443C90UL))
#define bFM4_MFT2_ADCMP_ACSC4_APBM             *((volatile unsigned char*)(0x42443C94UL))
#define bFM4_MFT2_ADCMP_ACSD4_AMOD             *((volatile unsigned char*)(0x42443CA0UL))
#define bFM4_MFT2_ADCMP_ACSD4_OCUS             *((volatile unsigned char*)(0x42443CA4UL))
#define bFM4_MFT2_ADCMP_ACSD4_DE               *((volatile unsigned char*)(0x42443CB0UL))
#define bFM4_MFT2_ADCMP_ACSD4_PE               *((volatile unsigned char*)(0x42443CB4UL))
#define bFM4_MFT2_ADCMP_ACSD4_UE               *((volatile unsigned char*)(0x42443CB8UL))
#define bFM4_MFT2_ADCMP_ACSD4_ZE               *((volatile unsigned char*)(0x42443CBCUL))
#define bFM4_MFT2_ADCMP_ACMC4_AMC0             *((volatile unsigned char*)(0x42443CC0UL))
#define bFM4_MFT2_ADCMP_ACMC4_AMC1             *((volatile unsigned char*)(0x42443CC4UL))
#define bFM4_MFT2_ADCMP_ACMC4_AMC2             *((volatile unsigned char*)(0x42443CC8UL))
#define bFM4_MFT2_ADCMP_ACMC4_AMC3             *((volatile unsigned char*)(0x42443CCCUL))
#define bFM4_MFT2_ADCMP_ACMC4_MZCE             *((volatile unsigned char*)(0x42443CD8UL))
#define bFM4_MFT2_ADCMP_ACMC4_MPCE             *((volatile unsigned char*)(0x42443CDCUL))
#define bFM4_MFT2_ADCMP_ACSC5_BUFE0            *((volatile unsigned char*)(0x42443D00UL))
#define bFM4_MFT2_ADCMP_ACSC5_BUFE1            *((volatile unsigned char*)(0x42443D04UL))
#define bFM4_MFT2_ADCMP_ACSC5_ADSEL0           *((volatile unsigned char*)(0x42443D08UL))
#define bFM4_MFT2_ADCMP_ACSC5_ADSEL1           *((volatile unsigned char*)(0x42443D0CUL))
#define bFM4_MFT2_ADCMP_ACSC5_ADSEL2           *((volatile unsigned char*)(0x42443D10UL))
#define bFM4_MFT2_ADCMP_ACSC5_APBM             *((volatile unsigned char*)(0x42443D14UL))
#define bFM4_MFT2_ADCMP_ACSD5_AMOD             *((volatile unsigned char*)(0x42443D20UL))
#define bFM4_MFT2_ADCMP_ACSD5_OCUS             *((volatile unsigned char*)(0x42443D24UL))
#define bFM4_MFT2_ADCMP_ACSD5_DE               *((volatile unsigned char*)(0x42443D30UL))
#define bFM4_MFT2_ADCMP_ACSD5_PE               *((volatile unsigned char*)(0x42443D34UL))
#define bFM4_MFT2_ADCMP_ACSD5_UE               *((volatile unsigned char*)(0x42443D38UL))
#define bFM4_MFT2_ADCMP_ACSD5_ZE               *((volatile unsigned char*)(0x42443D3CUL))
#define bFM4_MFT2_ADCMP_ACMC5_AMC0             *((volatile unsigned char*)(0x42443D40UL))
#define bFM4_MFT2_ADCMP_ACMC5_AMC1             *((volatile unsigned char*)(0x42443D44UL))
#define bFM4_MFT2_ADCMP_ACMC5_AMC2             *((volatile unsigned char*)(0x42443D48UL))
#define bFM4_MFT2_ADCMP_ACMC5_AMC3             *((volatile unsigned char*)(0x42443D4CUL))
#define bFM4_MFT2_ADCMP_ACMC5_MZCE             *((volatile unsigned char*)(0x42443D58UL))
#define bFM4_MFT2_ADCMP_ACMC5_MPCE             *((volatile unsigned char*)(0x42443D5CUL))

