MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* Multifunction Timer PPG registers */
#define bFM4_MFT_PPG_TTCR0_STR0                *((volatile unsigned char*)(0x42480020UL))
#define bFM4_MFT_PPG_TTCR0_MONI0               *((volatile unsigned char*)(0x42480024UL))
#define bFM4_MFT_PPG_TTCR0_CS00                *((volatile unsigned char*)(0x42480028UL))
#define bFM4_MFT_PPG_TTCR0_CS01                *((volatile unsigned char*)(0x4248002CUL))
#define bFM4_MFT_PPG_TTCR0_TRG0O               *((volatile unsigned char*)(0x42480030UL))
#define bFM4_MFT_PPG_TTCR0_TRG2O               *((volatile unsigned char*)(0x42480034UL))
#define bFM4_MFT_PPG_TTCR0_TRG4O               *((volatile unsigned char*)(0x42480038UL))
#define bFM4_MFT_PPG_TTCR0_TRG6O               *((volatile unsigned char*)(0x4248003CUL))
#define bFM4_MFT_PPG_TTCR1_STR1                *((volatile unsigned char*)(0x42480420UL))
#define bFM4_MFT_PPG_TTCR1_MONI1               *((volatile unsigned char*)(0x42480424UL))
#define bFM4_MFT_PPG_TTCR1_CS10                *((volatile unsigned char*)(0x42480428UL))
#define bFM4_MFT_PPG_TTCR1_CS11                *((volatile unsigned char*)(0x4248042CUL))
#define bFM4_MFT_PPG_TTCR1_TRG1O               *((volatile unsigned char*)(0x42480430UL))
#define bFM4_MFT_PPG_TTCR1_TRG3O               *((volatile unsigned char*)(0x42480434UL))
#define bFM4_MFT_PPG_TTCR1_TRG5O               *((volatile unsigned char*)(0x42480438UL))
#define bFM4_MFT_PPG_TTCR1_TRG7O               *((volatile unsigned char*)(0x4248043CUL))
#define bFM4_MFT_PPG_TTCR2_STR2                *((volatile unsigned char*)(0x42480820UL))
#define bFM4_MFT_PPG_TTCR2_MONI2               *((volatile unsigned char*)(0x42480824UL))
#define bFM4_MFT_PPG_TTCR2_CS20                *((volatile unsigned char*)(0x42480828UL))
#define bFM4_MFT_PPG_TTCR2_CS21                *((volatile unsigned char*)(0x4248082CUL))
#define bFM4_MFT_PPG_TTCR2_TRG16O              *((volatile unsigned char*)(0x42480830UL))
#define bFM4_MFT_PPG_TTCR2_TRG18O              *((volatile unsigned char*)(0x42480834UL))
#define bFM4_MFT_PPG_TTCR2_TRG20O              *((volatile unsigned char*)(0x42480838UL))
#define bFM4_MFT_PPG_TTCR2_TRG22O              *((volatile unsigned char*)(0x4248083CUL))
#define bFM4_MFT_PPG_TRG_PEN00                 *((volatile unsigned char*)(0x42482000UL))
#define bFM4_MFT_PPG_TRG_PEN01                 *((volatile unsigned char*)(0x42482004UL))
#define bFM4_MFT_PPG_TRG_PEN02                 *((volatile unsigned char*)(0x42482008UL))
#define bFM4_MFT_PPG_TRG_PEN03                 *((volatile unsigned char*)(0x4248200CUL))
#define bFM4_MFT_PPG_TRG_PEN04                 *((volatile unsigned char*)(0x42482010UL))
#define bFM4_MFT_PPG_TRG_PEN05                 *((volatile unsigned char*)(0x42482014UL))
#define bFM4_MFT_PPG_TRG_PEN06                 *((volatile unsigned char*)(0x42482018UL))
#define bFM4_MFT_PPG_TRG_PEN07                 *((volatile unsigned char*)(0x4248201CUL))
#define bFM4_MFT_PPG_TRG_PEN08                 *((volatile unsigned char*)(0x42482020UL))
#define bFM4_MFT_PPG_TRG_PEN09                 *((volatile unsigned char*)(0x42482024UL))
#define bFM4_MFT_PPG_TRG_PEN10                 *((volatile unsigned char*)(0x42482028UL))
#define bFM4_MFT_PPG_TRG_PEN11                 *((volatile unsigned char*)(0x4248202CUL))
#define bFM4_MFT_PPG_TRG_PEN12                 *((volatile unsigned char*)(0x42482030UL))
#define bFM4_MFT_PPG_TRG_PEN13                 *((volatile unsigned char*)(0x42482034UL))
#define bFM4_MFT_PPG_TRG_PEN14                 *((volatile unsigned char*)(0x42482038UL))
#define bFM4_MFT_PPG_TRG_PEN15                 *((volatile unsigned char*)(0x4248203CUL))
#define bFM4_MFT_PPG_REVC_REV00                *((volatile unsigned char*)(0x42482080UL))
#define bFM4_MFT_PPG_REVC_REV01                *((volatile unsigned char*)(0x42482084UL))
#define bFM4_MFT_PPG_REVC_REV02                *((volatile unsigned char*)(0x42482088UL))
#define bFM4_MFT_PPG_REVC_REV03                *((volatile unsigned char*)(0x4248208CUL))
#define bFM4_MFT_PPG_REVC_REV04                *((volatile unsigned char*)(0x42482090UL))
#define bFM4_MFT_PPG_REVC_REV05                *((volatile unsigned char*)(0x42482094UL))
#define bFM4_MFT_PPG_REVC_REV06                *((volatile unsigned char*)(0x42482098UL))
#define bFM4_MFT_PPG_REVC_REV07                *((volatile unsigned char*)(0x4248209CUL))
#define bFM4_MFT_PPG_REVC_REV08                *((volatile unsigned char*)(0x424820A0UL))
#define bFM4_MFT_PPG_REVC_REV09                *((volatile unsigned char*)(0x424820A4UL))
#define bFM4_MFT_PPG_REVC_REV10                *((volatile unsigned char*)(0x424820A8UL))
#define bFM4_MFT_PPG_REVC_REV11                *((volatile unsigned char*)(0x424820ACUL))
#define bFM4_MFT_PPG_REVC_REV12                *((volatile unsigned char*)(0x424820B0UL))
#define bFM4_MFT_PPG_REVC_REV13                *((volatile unsigned char*)(0x424820B4UL))
#define bFM4_MFT_PPG_REVC_REV14                *((volatile unsigned char*)(0x424820B8UL))
#define bFM4_MFT_PPG_REVC_REV15                *((volatile unsigned char*)(0x424820BCUL))
#define bFM4_MFT_PPG_TRG1_PEN16                *((volatile unsigned char*)(0x42482800UL))
#define bFM4_MFT_PPG_TRG1_PEN17                *((volatile unsigned char*)(0x42482804UL))
#define bFM4_MFT_PPG_TRG1_PEN18                *((volatile unsigned char*)(0x42482808UL))
#define bFM4_MFT_PPG_TRG1_PEN19                *((volatile unsigned char*)(0x4248280CUL))
#define bFM4_MFT_PPG_TRG1_PEN20                *((volatile unsigned char*)(0x42482810UL))
#define bFM4_MFT_PPG_TRG1_PEN21                *((volatile unsigned char*)(0x42482814UL))
#define bFM4_MFT_PPG_TRG1_PEN22                *((volatile unsigned char*)(0x42482818UL))
#define bFM4_MFT_PPG_TRG1_PEN23                *((volatile unsigned char*)(0x4248281CUL))
#define bFM4_MFT_PPG_REVC1_REV16               *((volatile unsigned char*)(0x42482880UL))
#define bFM4_MFT_PPG_REVC1_REV17               *((volatile unsigned char*)(0x42482884UL))
#define bFM4_MFT_PPG_REVC1_REV18               *((volatile unsigned char*)(0x42482888UL))
#define bFM4_MFT_PPG_REVC1_REV19               *((volatile unsigned char*)(0x4248288CUL))
#define bFM4_MFT_PPG_REVC1_REV20               *((volatile unsigned char*)(0x42482890UL))
#define bFM4_MFT_PPG_REVC1_REV21               *((volatile unsigned char*)(0x42482894UL))
#define bFM4_MFT_PPG_REVC1_REV22               *((volatile unsigned char*)(0x42482898UL))
#define bFM4_MFT_PPG_REVC1_REV23               *((volatile unsigned char*)(0x4248289CUL))
#define bFM4_MFT_PPG_PPGC1_TTRG                *((volatile unsigned char*)(0x42484000UL))
#define bFM4_MFT_PPG_PPGC1_PCS0                *((volatile unsigned char*)(0x4248400CUL))
#define bFM4_MFT_PPG_PPGC1_PCS1                *((volatile unsigned char*)(0x42484010UL))
#define bFM4_MFT_PPG_PPGC1_INTM                *((volatile unsigned char*)(0x42484014UL))
#define bFM4_MFT_PPG_PPGC1_PUF                 *((volatile unsigned char*)(0x42484018UL))
#define bFM4_MFT_PPG_PPGC1_PIE                 *((volatile unsigned char*)(0x4248401CUL))
#define bFM4_MFT_PPG_PPGC0_TTRG                *((volatile unsigned char*)(0x42484020UL))
#define bFM4_MFT_PPG_PPGC0_PCS0                *((volatile unsigned char*)(0x4248402CUL))
#define bFM4_MFT_PPG_PPGC0_PCS1                *((volatile unsigned char*)(0x42484030UL))
#define bFM4_MFT_PPG_PPGC0_INTM                *((volatile unsigned char*)(0x42484034UL))
#define bFM4_MFT_PPG_PPGC0_PUF                 *((volatile unsigned char*)(0x42484038UL))
#define bFM4_MFT_PPG_PPGC0_PIE                 *((volatile unsigned char*)(0x4248403CUL))
#define bFM4_MFT_PPG_PPGC3_TTRG                *((volatile unsigned char*)(0x42484080UL))
#define bFM4_MFT_PPG_PPGC3_PCS0                *((volatile unsigned char*)(0x4248408CUL))
#define bFM4_MFT_PPG_PPGC3_PCS1                *((volatile unsigned char*)(0x42484090UL))
#define bFM4_MFT_PPG_PPGC3_INTM                *((volatile unsigned char*)(0x42484094UL))
#define bFM4_MFT_PPG_PPGC3_PUF                 *((volatile unsigned char*)(0x42484098UL))
#define bFM4_MFT_PPG_PPGC3_PIE                 *((volatile unsigned char*)(0x4248409CUL))
#define bFM4_MFT_PPG_PPGC2_TTRG                *((volatile unsigned char*)(0x424840A0UL))
#define bFM4_MFT_PPG_PPGC2_PCS0                *((volatile unsigned char*)(0x424840ACUL))
#define bFM4_MFT_PPG_PPGC2_PCS1                *((volatile unsigned char*)(0x424840B0UL))
#define bFM4_MFT_PPG_PPGC2_INTM                *((volatile unsigned char*)(0x424840B4UL))
#define bFM4_MFT_PPG_PPGC2_PUF                 *((volatile unsigned char*)(0x424840B8UL))
#define bFM4_MFT_PPG_PPGC2_PIE                 *((volatile unsigned char*)(0x424840BCUL))
#define bFM4_MFT_PPG_GATEC0_EDGE0              *((volatile unsigned char*)(0x42484300UL))
#define bFM4_MFT_PPG_GATEC0_STRG0              *((volatile unsigned char*)(0x42484304UL))
#define bFM4_MFT_PPG_GATEC0_EDGE2              *((volatile unsigned char*)(0x42484310UL))
#define bFM4_MFT_PPG_GATEC0_STRG2              *((volatile unsigned char*)(0x42484314UL))
#define bFM4_MFT_PPG_PPGC5_TTRG                *((volatile unsigned char*)(0x42484800UL))
#define bFM4_MFT_PPG_PPGC5_PCS0                *((volatile unsigned char*)(0x4248480CUL))
#define bFM4_MFT_PPG_PPGC5_PCS1                *((volatile unsigned char*)(0x42484810UL))
#define bFM4_MFT_PPG_PPGC5_INTM                *((volatile unsigned char*)(0x42484814UL))
#define bFM4_MFT_PPG_PPGC5_PUF                 *((volatile unsigned char*)(0x42484818UL))
#define bFM4_MFT_PPG_PPGC5_PIE                 *((volatile unsigned char*)(0x4248481CUL))
#define bFM4_MFT_PPG_PPGC4_TTRG                *((volatile unsigned char*)(0x42484820UL))
#define bFM4_MFT_PPG_PPGC4_PCS0                *((volatile unsigned char*)(0x4248482CUL))
#define bFM4_MFT_PPG_PPGC4_PCS1                *((volatile unsigned char*)(0x42484830UL))
#define bFM4_MFT_PPG_PPGC4_INTM                *((volatile unsigned char*)(0x42484834UL))
#define bFM4_MFT_PPG_PPGC4_PUF                 *((volatile unsigned char*)(0x42484838UL))
#define bFM4_MFT_PPG_PPGC4_PIE                 *((volatile unsigned char*)(0x4248483CUL))
#define bFM4_MFT_PPG_PPGC7_TTRG                *((volatile unsigned char*)(0x42484880UL))
#define bFM4_MFT_PPG_PPGC7_PCS0                *((volatile unsigned char*)(0x4248488CUL))
#define bFM4_MFT_PPG_PPGC7_PCS1                *((volatile unsigned char*)(0x42484890UL))
#define bFM4_MFT_PPG_PPGC7_INTM                *((volatile unsigned char*)(0x42484894UL))
#define bFM4_MFT_PPG_PPGC7_PUF                 *((volatile unsigned char*)(0x42484898UL))
#define bFM4_MFT_PPG_PPGC7_PIE                 *((volatile unsigned char*)(0x4248489CUL))
#define bFM4_MFT_PPG_PPGC6_TTRG                *((volatile unsigned char*)(0x424848A0UL))
#define bFM4_MFT_PPG_PPGC6_PCS0                *((volatile unsigned char*)(0x424848ACUL))
#define bFM4_MFT_PPG_PPGC6_PCS1                *((volatile unsigned char*)(0x424848B0UL))
#define bFM4_MFT_PPG_PPGC6_INTM                *((volatile unsigned char*)(0x424848B4UL))
#define bFM4_MFT_PPG_PPGC6_PUF                 *((volatile unsigned char*)(0x424848B8UL))
#define bFM4_MFT_PPG_PPGC6_PIE                 *((volatile unsigned char*)(0x424848BCUL))
#define bFM4_MFT_PPG_GATEC4_EDGE4              *((volatile unsigned char*)(0x42484B00UL))
#define bFM4_MFT_PPG_GATEC4_STRG4              *((volatile unsigned char*)(0x42484B04UL))
#define bFM4_MFT_PPG_GATEC4_EDGE6              *((volatile unsigned char*)(0x42484B10UL))
#define bFM4_MFT_PPG_GATEC4_STRG6              *((volatile unsigned char*)(0x42484B14UL))
#define bFM4_MFT_PPG_PPGC9_TTRG                *((volatile unsigned char*)(0x42485000UL))
#define bFM4_MFT_PPG_PPGC9_PCS0                *((volatile unsigned char*)(0x4248500CUL))
#define bFM4_MFT_PPG_PPGC9_PCS1                *((volatile unsigned char*)(0x42485010UL))
#define bFM4_MFT_PPG_PPGC9_INTM                *((volatile unsigned char*)(0x42485014UL))
#define bFM4_MFT_PPG_PPGC9_PUF                 *((volatile unsigned char*)(0x42485018UL))
#define bFM4_MFT_PPG_PPGC9_PIE                 *((volatile unsigned char*)(0x4248501CUL))
#define bFM4_MFT_PPG_PPGC8_TTRG                *((volatile unsigned char*)(0x42485020UL))
#define bFM4_MFT_PPG_PPGC8_PCS0                *((volatile unsigned char*)(0x4248502CUL))
#define bFM4_MFT_PPG_PPGC8_PCS1                *((volatile unsigned char*)(0x42485030UL))
#define bFM4_MFT_PPG_PPGC8_INTM                *((volatile unsigned char*)(0x42485034UL))
#define bFM4_MFT_PPG_PPGC8_PUF                 *((volatile unsigned char*)(0x42485038UL))
#define bFM4_MFT_PPG_PPGC8_PIE                 *((volatile unsigned char*)(0x4248503CUL))
#define bFM4_MFT_PPG_PPGC11_TTRG               *((volatile unsigned char*)(0x42485080UL))
#define bFM4_MFT_PPG_PPGC11_PCS0               *((volatile unsigned char*)(0x4248508CUL))
#define bFM4_MFT_PPG_PPGC11_PCS1               *((volatile unsigned char*)(0x42485090UL))
#define bFM4_MFT_PPG_PPGC11_INTM               *((volatile unsigned char*)(0x42485094UL))
#define bFM4_MFT_PPG_PPGC11_PUF                *((volatile unsigned char*)(0x42485098UL))
#define bFM4_MFT_PPG_PPGC11_PIE                *((volatile unsigned char*)(0x4248509CUL))
#define bFM4_MFT_PPG_PPGC10_TTRG               *((volatile unsigned char*)(0x424850A0UL))
#define bFM4_MFT_PPG_PPGC10_PCS0               *((volatile unsigned char*)(0x424850ACUL))
#define bFM4_MFT_PPG_PPGC10_PCS1               *((volatile unsigned char*)(0x424850B0UL))
#define bFM4_MFT_PPG_PPGC10_INTM               *((volatile unsigned char*)(0x424850B4UL))
#define bFM4_MFT_PPG_PPGC10_PUF                *((volatile unsigned char*)(0x424850B8UL))
#define bFM4_MFT_PPG_PPGC10_PIE                *((volatile unsigned char*)(0x424850BCUL))
#define bFM4_MFT_PPG_GATEC8_EDGE8              *((volatile unsigned char*)(0x42485300UL))
#define bFM4_MFT_PPG_GATEC8_STRG8              *((volatile unsigned char*)(0x42485304UL))
#define bFM4_MFT_PPG_GATEC8_EDGE10             *((volatile unsigned char*)(0x42485310UL))
#define bFM4_MFT_PPG_GATEC8_STRG10             *((volatile unsigned char*)(0x42485314UL))
#define bFM4_MFT_PPG_PPGC13_TTRG               *((volatile unsigned char*)(0x42485800UL))
#define bFM4_MFT_PPG_PPGC13_PCS0               *((volatile unsigned char*)(0x4248580CUL))
#define bFM4_MFT_PPG_PPGC13_PCS1               *((volatile unsigned char*)(0x42485810UL))
#define bFM4_MFT_PPG_PPGC13_INTM               *((volatile unsigned char*)(0x42485814UL))
#define bFM4_MFT_PPG_PPGC13_PUF                *((volatile unsigned char*)(0x42485818UL))
#define bFM4_MFT_PPG_PPGC13_PIE                *((volatile unsigned char*)(0x4248581CUL))
#define bFM4_MFT_PPG_PPGC12_TTRG               *((volatile unsigned char*)(0x42485820UL))
#define bFM4_MFT_PPG_PPGC12_PCS0               *((volatile unsigned char*)(0x4248582CUL))
#define bFM4_MFT_PPG_PPGC12_PCS1               *((volatile unsigned char*)(0x42485830UL))
#define bFM4_MFT_PPG_PPGC12_INTM               *((volatile unsigned char*)(0x42485834UL))
#define bFM4_MFT_PPG_PPGC12_PUF                *((volatile unsigned char*)(0x42485838UL))
#define bFM4_MFT_PPG_PPGC12_PIE                *((volatile unsigned char*)(0x4248583CUL))
#define bFM4_MFT_PPG_PPGC15_TTRG               *((volatile unsigned char*)(0x42485880UL))
#define bFM4_MFT_PPG_PPGC15_PCS0               *((volatile unsigned char*)(0x4248588CUL))
#define bFM4_MFT_PPG_PPGC15_PCS1               *((volatile unsigned char*)(0x42485890UL))
#define bFM4_MFT_PPG_PPGC15_INTM               *((volatile unsigned char*)(0x42485894UL))
#define bFM4_MFT_PPG_PPGC15_PUF                *((volatile unsigned char*)(0x42485898UL))
#define bFM4_MFT_PPG_PPGC15_PIE                *((volatile unsigned char*)(0x4248589CUL))
#define bFM4_MFT_PPG_PPGC14_TTRG               *((volatile unsigned char*)(0x424858A0UL))
#define bFM4_MFT_PPG_PPGC14_PCS0               *((volatile unsigned char*)(0x424858ACUL))
#define bFM4_MFT_PPG_PPGC14_PCS1               *((volatile unsigned char*)(0x424858B0UL))
#define bFM4_MFT_PPG_PPGC14_INTM               *((volatile unsigned char*)(0x424858B4UL))
#define bFM4_MFT_PPG_PPGC14_PUF                *((volatile unsigned char*)(0x424858B8UL))
#define bFM4_MFT_PPG_PPGC14_PIE                *((volatile unsigned char*)(0x424858BCUL))
#define bFM4_MFT_PPG_GATEC12_EDGE12            *((volatile unsigned char*)(0x42485B00UL))
#define bFM4_MFT_PPG_GATEC12_STRG12            *((volatile unsigned char*)(0x42485B04UL))
#define bFM4_MFT_PPG_GATEC12_EDGE14            *((volatile unsigned char*)(0x42485B10UL))
#define bFM4_MFT_PPG_GATEC12_STRG14            *((volatile unsigned char*)(0x42485B14UL))
#define bFM4_MFT_PPG_PPGC17_TTRG               *((volatile unsigned char*)(0x42486000UL))
#define bFM4_MFT_PPG_PPGC17_PCS0               *((volatile unsigned char*)(0x4248600CUL))
#define bFM4_MFT_PPG_PPGC17_PCS1               *((volatile unsigned char*)(0x42486010UL))
#define bFM4_MFT_PPG_PPGC17_INTM               *((volatile unsigned char*)(0x42486014UL))
#define bFM4_MFT_PPG_PPGC17_PUF                *((volatile unsigned char*)(0x42486018UL))
#define bFM4_MFT_PPG_PPGC17_PIE                *((volatile unsigned char*)(0x4248601CUL))
#define bFM4_MFT_PPG_PPGC16_TTRG               *((volatile unsigned char*)(0x42486020UL))
#define bFM4_MFT_PPG_PPGC16_PCS0               *((volatile unsigned char*)(0x4248602CUL))
#define bFM4_MFT_PPG_PPGC16_PCS1               *((volatile unsigned char*)(0x42486030UL))
#define bFM4_MFT_PPG_PPGC16_INTM               *((volatile unsigned char*)(0x42486034UL))
#define bFM4_MFT_PPG_PPGC16_PUF                *((volatile unsigned char*)(0x42486038UL))
#define bFM4_MFT_PPG_PPGC16_PIE                *((volatile unsigned char*)(0x4248603CUL))
#define bFM4_MFT_PPG_PPGC19_TTRG               *((volatile unsigned char*)(0x42486080UL))
#define bFM4_MFT_PPG_PPGC19_PCS0               *((volatile unsigned char*)(0x4248608CUL))
#define bFM4_MFT_PPG_PPGC19_PCS1               *((volatile unsigned char*)(0x42486090UL))
#define bFM4_MFT_PPG_PPGC19_INTM               *((volatile unsigned char*)(0x42486094UL))
#define bFM4_MFT_PPG_PPGC19_PUF                *((volatile unsigned char*)(0x42486098UL))
#define bFM4_MFT_PPG_PPGC19_PIE                *((volatile unsigned char*)(0x4248609CUL))
#define bFM4_MFT_PPG_PPGC18_TTRG               *((volatile unsigned char*)(0x424860A0UL))
#define bFM4_MFT_PPG_PPGC18_PCS0               *((volatile unsigned char*)(0x424860ACUL))
#define bFM4_MFT_PPG_PPGC18_PCS1               *((volatile unsigned char*)(0x424860B0UL))
#define bFM4_MFT_PPG_PPGC18_INTM               *((volatile unsigned char*)(0x424860B4UL))
#define bFM4_MFT_PPG_PPGC18_PUF                *((volatile unsigned char*)(0x424860B8UL))
#define bFM4_MFT_PPG_PPGC18_PIE                *((volatile unsigned char*)(0x424860BCUL))
#define bFM4_MFT_PPG_GATEC16_EDGE16            *((volatile unsigned char*)(0x42486300UL))
#define bFM4_MFT_PPG_GATEC16_STRG16            *((volatile unsigned char*)(0x42486304UL))
#define bFM4_MFT_PPG_GATEC16_EDGE18            *((volatile unsigned char*)(0x42486310UL))
#define bFM4_MFT_PPG_GATEC16_STRG18            *((volatile unsigned char*)(0x42486314UL))
#define bFM4_MFT_PPG_PPGC21_TTRG               *((volatile unsigned char*)(0x42486800UL))
#define bFM4_MFT_PPG_PPGC21_PCS0               *((volatile unsigned char*)(0x4248680CUL))
#define bFM4_MFT_PPG_PPGC21_PCS1               *((volatile unsigned char*)(0x42486810UL))
#define bFM4_MFT_PPG_PPGC21_INTM               *((volatile unsigned char*)(0x42486814UL))
#define bFM4_MFT_PPG_PPGC21_PUF                *((volatile unsigned char*)(0x42486818UL))
#define bFM4_MFT_PPG_PPGC21_PIE                *((volatile unsigned char*)(0x4248681CUL))
#define bFM4_MFT_PPG_PPGC20_TTRG               *((volatile unsigned char*)(0x42486820UL))
#define bFM4_MFT_PPG_PPGC20_PCS0               *((volatile unsigned char*)(0x4248682CUL))
#define bFM4_MFT_PPG_PPGC20_PCS1               *((volatile unsigned char*)(0x42486830UL))
#define bFM4_MFT_PPG_PPGC20_INTM               *((volatile unsigned char*)(0x42486834UL))
#define bFM4_MFT_PPG_PPGC20_PUF                *((volatile unsigned char*)(0x42486838UL))
#define bFM4_MFT_PPG_PPGC20_PIE                *((volatile unsigned char*)(0x4248683CUL))
#define bFM4_MFT_PPG_PPGC23_TTRG               *((volatile unsigned char*)(0x42486880UL))
#define bFM4_MFT_PPG_PPGC23_PCS0               *((volatile unsigned char*)(0x4248688CUL))
#define bFM4_MFT_PPG_PPGC23_PCS1               *((volatile unsigned char*)(0x42486890UL))
#define bFM4_MFT_PPG_PPGC23_INTM               *((volatile unsigned char*)(0x42486894UL))
#define bFM4_MFT_PPG_PPGC23_PUF                *((volatile unsigned char*)(0x42486898UL))
#define bFM4_MFT_PPG_PPGC23_PIE                *((volatile unsigned char*)(0x4248689CUL))
#define bFM4_MFT_PPG_PPGC22_TTRG               *((volatile unsigned char*)(0x424868A0UL))
#define bFM4_MFT_PPG_PPGC22_PCS0               *((volatile unsigned char*)(0x424868ACUL))
#define bFM4_MFT_PPG_PPGC22_PCS1               *((volatile unsigned char*)(0x424868B0UL))
#define bFM4_MFT_PPG_PPGC22_INTM               *((volatile unsigned char*)(0x424868B4UL))
#define bFM4_MFT_PPG_PPGC22_PUF                *((volatile unsigned char*)(0x424868B8UL))
#define bFM4_MFT_PPG_PPGC22_PIE                *((volatile unsigned char*)(0x424868BCUL))
#define bFM4_MFT_PPG_GATEC20_EDGE20            *((volatile unsigned char*)(0x42486B00UL))
#define bFM4_MFT_PPG_GATEC20_STRG20            *((volatile unsigned char*)(0x42486B04UL))
#define bFM4_MFT_PPG_GATEC20_EDGE22            *((volatile unsigned char*)(0x42486B10UL))
#define bFM4_MFT_PPG_GATEC20_STRG22            *((volatile unsigned char*)(0x42486B14UL))

/* Base Timer 0 PPG registers */
#define bFM4_BT0_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_PPG_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_PPG_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_PPG_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A01A8UL))
#define bFM4_BT0_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A01ACUL))
#define bFM4_BT0_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0220UL))

