MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* MFS UART channel 1 registers */
#define bFM4_MFS1_UART_SMR_SOE                 *((volatile unsigned char*)(0x42702000UL))
#define bFM4_MFS1_UART_SMR_BDS                 *((volatile unsigned char*)(0x42702008UL))
#define bFM4_MFS1_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270200CUL))
#define bFM4_MFS1_UART_SMR_WUCR                *((volatile unsigned char*)(0x42702010UL))
#define bFM4_MFS1_UART_SMR_MD0                 *((volatile unsigned char*)(0x42702014UL))
#define bFM4_MFS1_UART_SMR_MD1                 *((volatile unsigned char*)(0x42702018UL))
#define bFM4_MFS1_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270201CUL))
#define bFM4_MFS1_UART_SCR_TXE                 *((volatile unsigned char*)(0x42702020UL))
#define bFM4_MFS1_UART_SCR_RXE                 *((volatile unsigned char*)(0x42702024UL))
#define bFM4_MFS1_UART_SCR_TBIE                *((volatile unsigned char*)(0x42702028UL))
#define bFM4_MFS1_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270202CUL))
#define bFM4_MFS1_UART_SCR_RIE                 *((volatile unsigned char*)(0x42702030UL))
#define bFM4_MFS1_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270203CUL))
#define bFM4_MFS1_UART_ESCR_L0                 *((volatile unsigned char*)(0x42702080UL))
#define bFM4_MFS1_UART_ESCR_L1                 *((volatile unsigned char*)(0x42702084UL))
#define bFM4_MFS1_UART_ESCR_L2                 *((volatile unsigned char*)(0x42702088UL))
#define bFM4_MFS1_UART_ESCR_P                  *((volatile unsigned char*)(0x4270208CUL))
#define bFM4_MFS1_UART_ESCR_PEN                *((volatile unsigned char*)(0x42702090UL))
#define bFM4_MFS1_UART_ESCR_INV                *((volatile unsigned char*)(0x42702094UL))
#define bFM4_MFS1_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42702098UL))
#define bFM4_MFS1_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270209CUL))
#define bFM4_MFS1_UART_SSR_TBI                 *((volatile unsigned char*)(0x427020A0UL))
#define bFM4_MFS1_UART_SSR_TDRE                *((volatile unsigned char*)(0x427020A4UL))
#define bFM4_MFS1_UART_SSR_RDRF                *((volatile unsigned char*)(0x427020A8UL))
#define bFM4_MFS1_UART_SSR_ORE                 *((volatile unsigned char*)(0x427020ACUL))
#define bFM4_MFS1_UART_SSR_FRE                 *((volatile unsigned char*)(0x427020B0UL))
#define bFM4_MFS1_UART_SSR_PE                  *((volatile unsigned char*)(0x427020B4UL))
#define bFM4_MFS1_UART_SSR_REC                 *((volatile unsigned char*)(0x427020BCUL))
#define bFM4_MFS1_UART_BGR_EXT                 *((volatile unsigned char*)(0x427021BCUL))
#define bFM4_MFS1_UART_BGR1_EXT                *((volatile unsigned char*)(0x427021BCUL))
#define bFM4_MFS1_UART_FCR_FE1                 *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_UART_FCR_FE2                 *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_UART_FCR_FCL1                *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_UART_FCR_FSET                *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_UART_FCR_FLD                 *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_UART_FCR_FLST                *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_UART_FCR_FSEL                *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_UART_FCR_FTIE                *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_UART_FCR0_FE1                *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_UART_FCR0_FE2                *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_UART_FCR0_FSET               *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_UART_FCR0_FLD                *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_UART_FCR0_FLST               *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270233CUL))
#define bFM4_MFS1_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270233CUL))

