MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* MFS CSIO channel 11 registers */
#define bFM4_MFS11_CSIO_SMR_SOE                *((volatile unsigned char*)(0x42716000UL))
#define bFM4_MFS11_CSIO_SMR_SCKE               *((volatile unsigned char*)(0x42716004UL))
#define bFM4_MFS11_CSIO_SMR_BDS                *((volatile unsigned char*)(0x42716008UL))
#define bFM4_MFS11_CSIO_SMR_SCINV              *((volatile unsigned char*)(0x4271600CUL))
#define bFM4_MFS11_CSIO_SMR_MD0                *((volatile unsigned char*)(0x42716014UL))
#define bFM4_MFS11_CSIO_SMR_MD1                *((volatile unsigned char*)(0x42716018UL))
#define bFM4_MFS11_CSIO_SMR_MD2                *((volatile unsigned char*)(0x4271601CUL))
#define bFM4_MFS11_CSIO_SCR_TXE                *((volatile unsigned char*)(0x42716020UL))
#define bFM4_MFS11_CSIO_SCR_RXE                *((volatile unsigned char*)(0x42716024UL))
#define bFM4_MFS11_CSIO_SCR_TBIE               *((volatile unsigned char*)(0x42716028UL))
#define bFM4_MFS11_CSIO_SCR_TIE                *((volatile unsigned char*)(0x4271602CUL))
#define bFM4_MFS11_CSIO_SCR_RIE                *((volatile unsigned char*)(0x42716030UL))
#define bFM4_MFS11_CSIO_SCR_SPI                *((volatile unsigned char*)(0x42716034UL))
#define bFM4_MFS11_CSIO_SCR_MS                 *((volatile unsigned char*)(0x42716038UL))
#define bFM4_MFS11_CSIO_SCR_UPCL               *((volatile unsigned char*)(0x4271603CUL))
#define bFM4_MFS11_CSIO_ESCR_L0                *((volatile unsigned char*)(0x42716080UL))
#define bFM4_MFS11_CSIO_ESCR_L1                *((volatile unsigned char*)(0x42716084UL))
#define bFM4_MFS11_CSIO_ESCR_L2                *((volatile unsigned char*)(0x42716088UL))
#define bFM4_MFS11_CSIO_ESCR_WT0               *((volatile unsigned char*)(0x4271608CUL))
#define bFM4_MFS11_CSIO_ESCR_WT1               *((volatile unsigned char*)(0x42716090UL))
#define bFM4_MFS11_CSIO_ESCR_CSFE              *((volatile unsigned char*)(0x42716094UL))
#define bFM4_MFS11_CSIO_ESCR_L3                *((volatile unsigned char*)(0x42716098UL))
#define bFM4_MFS11_CSIO_ESCR_SOP               *((volatile unsigned char*)(0x4271609CUL))
#define bFM4_MFS11_CSIO_SSR_TBI                *((volatile unsigned char*)(0x427160A0UL))
#define bFM4_MFS11_CSIO_SSR_TDRE               *((volatile unsigned char*)(0x427160A4UL))
#define bFM4_MFS11_CSIO_SSR_RDRF               *((volatile unsigned char*)(0x427160A8UL))
#define bFM4_MFS11_CSIO_SSR_ORE                *((volatile unsigned char*)(0x427160ACUL))
#define bFM4_MFS11_CSIO_SSR_AWC                *((volatile unsigned char*)(0x427160B0UL))
#define bFM4_MFS11_CSIO_SSR_REC                *((volatile unsigned char*)(0x427160BCUL))
#define bFM4_MFS11_CSIO_FCR_FE1                *((volatile unsigned char*)(0x42716280UL))
#define bFM4_MFS11_CSIO_FCR_FE2                *((volatile unsigned char*)(0x42716284UL))
#define bFM4_MFS11_CSIO_FCR_FCL1               *((volatile unsigned char*)(0x42716288UL))
#define bFM4_MFS11_CSIO_FCR_FCL2               *((volatile unsigned char*)(0x4271628CUL))
#define bFM4_MFS11_CSIO_FCR_FSET               *((volatile unsigned char*)(0x42716290UL))
#define bFM4_MFS11_CSIO_FCR_FLD                *((volatile unsigned char*)(0x42716294UL))
#define bFM4_MFS11_CSIO_FCR_FLST               *((volatile unsigned char*)(0x42716298UL))
#define bFM4_MFS11_CSIO_FCR_FSEL               *((volatile unsigned char*)(0x427162A0UL))
#define bFM4_MFS11_CSIO_FCR_FTIE               *((volatile unsigned char*)(0x427162A4UL))
#define bFM4_MFS11_CSIO_FCR_FDRQ               *((volatile unsigned char*)(0x427162A8UL))
#define bFM4_MFS11_CSIO_FCR_FRIIE              *((volatile unsigned char*)(0x427162ACUL))
#define bFM4_MFS11_CSIO_FCR_FLSTE              *((volatile unsigned char*)(0x427162B0UL))
#define bFM4_MFS11_CSIO_FCR0_FE1               *((volatile unsigned char*)(0x42716280UL))
#define bFM4_MFS11_CSIO_FCR0_FE2               *((volatile unsigned char*)(0x42716284UL))
#define bFM4_MFS11_CSIO_FCR0_FCL1              *((volatile unsigned char*)(0x42716288UL))
#define bFM4_MFS11_CSIO_FCR0_FCL2              *((volatile unsigned char*)(0x4271628CUL))
#define bFM4_MFS11_CSIO_FCR0_FSET              *((volatile unsigned char*)(0x42716290UL))
#define bFM4_MFS11_CSIO_FCR0_FLD               *((volatile unsigned char*)(0x42716294UL))
#define bFM4_MFS11_CSIO_FCR0_FLST              *((volatile unsigned char*)(0x42716298UL))
#define bFM4_MFS11_CSIO_FCR1_FSEL              *((volatile unsigned char*)(0x427162A0UL))
#define bFM4_MFS11_CSIO_FCR1_FTIE              *((volatile unsigned char*)(0x427162A4UL))
#define bFM4_MFS11_CSIO_FCR1_FDRQ              *((volatile unsigned char*)(0x427162A8UL))
#define bFM4_MFS11_CSIO_FCR1_FRIIE             *((volatile unsigned char*)(0x427162ACUL))
#define bFM4_MFS11_CSIO_FCR1_FLSTE             *((volatile unsigned char*)(0x427162B0UL))
#define bFM4_MFS11_CSIO_FBYTE_FD0              *((volatile unsigned char*)(0x42716300UL))
#define bFM4_MFS11_CSIO_FBYTE_FD1              *((volatile unsigned char*)(0x42716304UL))
#define bFM4_MFS11_CSIO_FBYTE_FD2              *((volatile unsigned char*)(0x42716308UL))
#define bFM4_MFS11_CSIO_FBYTE_FD3              *((volatile unsigned char*)(0x4271630CUL))
#define bFM4_MFS11_CSIO_FBYTE_FD4              *((volatile unsigned char*)(0x42716310UL))
#define bFM4_MFS11_CSIO_FBYTE_FD5              *((volatile unsigned char*)(0x42716314UL))
#define bFM4_MFS11_CSIO_FBYTE_FD6              *((volatile unsigned char*)(0x42716318UL))
#define bFM4_MFS11_CSIO_FBYTE_FD7              *((volatile unsigned char*)(0x4271631CUL))
#define bFM4_MFS11_CSIO_FBYTE_FD8              *((volatile unsigned char*)(0x42716320UL))
#define bFM4_MFS11_CSIO_FBYTE_FD9              *((volatile unsigned char*)(0x42716324UL))
#define bFM4_MFS11_CSIO_FBYTE_FD10             *((volatile unsigned char*)(0x42716328UL))
#define bFM4_MFS11_CSIO_FBYTE_FD11             *((volatile unsigned char*)(0x4271632CUL))
#define bFM4_MFS11_CSIO_FBYTE_FD12             *((volatile unsigned char*)(0x42716330UL))
#define bFM4_MFS11_CSIO_FBYTE_FD13             *((volatile unsigned char*)(0x42716334UL))
#define bFM4_MFS11_CSIO_FBYTE_FD14             *((volatile unsigned char*)(0x42716338UL))
#define bFM4_MFS11_CSIO_FBYTE_FD15             *((volatile unsigned char*)(0x4271633CUL))
#define bFM4_MFS11_CSIO_FBYTE1_FD0             *((volatile unsigned char*)(0x42716300UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD1             *((volatile unsigned char*)(0x42716304UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD2             *((volatile unsigned char*)(0x42716308UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD3             *((volatile unsigned char*)(0x4271630CUL))
#define bFM4_MFS11_CSIO_FBYTE1_FD4             *((volatile unsigned char*)(0x42716310UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD5             *((volatile unsigned char*)(0x42716314UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD6             *((volatile unsigned char*)(0x42716318UL))
#define bFM4_MFS11_CSIO_FBYTE1_FD7             *((volatile unsigned char*)(0x4271631CUL))
#define bFM4_MFS11_CSIO_FBYTE2_FD8             *((volatile unsigned char*)(0x42716320UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD9             *((volatile unsigned char*)(0x42716324UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD10            *((volatile unsigned char*)(0x42716328UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD11            *((volatile unsigned char*)(0x4271632CUL))
#define bFM4_MFS11_CSIO_FBYTE2_FD12            *((volatile unsigned char*)(0x42716330UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD13            *((volatile unsigned char*)(0x42716334UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD14            *((volatile unsigned char*)(0x42716338UL))
#define bFM4_MFS11_CSIO_FBYTE2_FD15            *((volatile unsigned char*)(0x4271633CUL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD0          *((volatile unsigned char*)(0x42716380UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD1          *((volatile unsigned char*)(0x42716384UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD2          *((volatile unsigned char*)(0x42716388UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD3          *((volatile unsigned char*)(0x4271638CUL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD4          *((volatile unsigned char*)(0x42716390UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD5          *((volatile unsigned char*)(0x42716394UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD6          *((volatile unsigned char*)(0x42716398UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSHD7          *((volatile unsigned char*)(0x4271639CUL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU0          *((volatile unsigned char*)(0x427163A0UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU1          *((volatile unsigned char*)(0x427163A4UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU2          *((volatile unsigned char*)(0x427163A8UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU3          *((volatile unsigned char*)(0x427163ACUL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU4          *((volatile unsigned char*)(0x427163B0UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU5          *((volatile unsigned char*)(0x427163B4UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU6          *((volatile unsigned char*)(0x427163B8UL))
#define bFM4_MFS11_CSIO_SCSTR10_CSSU7          *((volatile unsigned char*)(0x427163BCUL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS0          *((volatile unsigned char*)(0x42716400UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS1          *((volatile unsigned char*)(0x42716404UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS2          *((volatile unsigned char*)(0x42716408UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS3          *((volatile unsigned char*)(0x4271640CUL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS4          *((volatile unsigned char*)(0x42716410UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS5          *((volatile unsigned char*)(0x42716414UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS6          *((volatile unsigned char*)(0x42716418UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS7          *((volatile unsigned char*)(0x4271641CUL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS8          *((volatile unsigned char*)(0x42716420UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS9          *((volatile unsigned char*)(0x42716424UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS10         *((volatile unsigned char*)(0x42716428UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS11         *((volatile unsigned char*)(0x4271642CUL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS12         *((volatile unsigned char*)(0x42716430UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS13         *((volatile unsigned char*)(0x42716434UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS14         *((volatile unsigned char*)(0x42716438UL))
#define bFM4_MFS11_CSIO_SCSTR32_CSDS15         *((volatile unsigned char*)(0x4271643CUL))
#define bFM4_MFS11_CSIO_SACSR_TMRE             *((volatile unsigned char*)(0x42716480UL))
#define bFM4_MFS11_CSIO_SACSR_TDIV0            *((volatile unsigned char*)(0x42716484UL))
#define bFM4_MFS11_CSIO_SACSR_TDIV1            *((volatile unsigned char*)(0x42716488UL))
#define bFM4_MFS11_CSIO_SACSR_TDIV2            *((volatile unsigned char*)(0x4271648CUL))
#define bFM4_MFS11_CSIO_SACSR_TDIV3            *((volatile unsigned char*)(0x42716490UL))
#define bFM4_MFS11_CSIO_SACSR_TSYNE            *((volatile unsigned char*)(0x42716498UL))
#define bFM4_MFS11_CSIO_SACSR_TINTE            *((volatile unsigned char*)(0x4271649CUL))
#define bFM4_MFS11_CSIO_SACSR_TINT             *((volatile unsigned char*)(0x427164A0UL))
#define bFM4_MFS11_CSIO_SACSR_CSE              *((volatile unsigned char*)(0x427164ACUL))
#define bFM4_MFS11_CSIO_SACSR_CSEIE            *((volatile unsigned char*)(0x427164B0UL))
#define bFM4_MFS11_CSIO_SACSR_TBEEN            *((volatile unsigned char*)(0x427164B4UL))
#define bFM4_MFS11_CSIO_STMR_TM0               *((volatile unsigned char*)(0x42716500UL))
#define bFM4_MFS11_CSIO_STMR_TM1               *((volatile unsigned char*)(0x42716504UL))
#define bFM4_MFS11_CSIO_STMR_TM2               *((volatile unsigned char*)(0x42716508UL))
#define bFM4_MFS11_CSIO_STMR_TM3               *((volatile unsigned char*)(0x4271650CUL))
#define bFM4_MFS11_CSIO_STMR_TM4               *((volatile unsigned char*)(0x42716510UL))
#define bFM4_MFS11_CSIO_STMR_TM5               *((volatile unsigned char*)(0x42716514UL))
#define bFM4_MFS11_CSIO_STMR_TM6               *((volatile unsigned char*)(0x42716518UL))
#define bFM4_MFS11_CSIO_STMR_TM7               *((volatile unsigned char*)(0x4271651CUL))
#define bFM4_MFS11_CSIO_STMR_TM8               *((volatile unsigned char*)(0x42716520UL))
#define bFM4_MFS11_CSIO_STMR_TM9               *((volatile unsigned char*)(0x42716524UL))
#define bFM4_MFS11_CSIO_STMR_TM10              *((volatile unsigned char*)(0x42716528UL))
#define bFM4_MFS11_CSIO_STMR_TM11              *((volatile unsigned char*)(0x4271652CUL))
#define bFM4_MFS11_CSIO_STMR_TM12              *((volatile unsigned char*)(0x42716530UL))
#define bFM4_MFS11_CSIO_STMR_TM13              *((volatile unsigned char*)(0x42716534UL))
#define bFM4_MFS11_CSIO_STMR_TM14              *((volatile unsigned char*)(0x42716538UL))
#define bFM4_MFS11_CSIO_STMR_TM15              *((volatile unsigned char*)(0x4271653CUL))
#define bFM4_MFS11_CSIO_STMCR_TC0              *((volatile unsigned char*)(0x42716580UL))
#define bFM4_MFS11_CSIO_STMCR_TC1              *((volatile unsigned char*)(0x42716584UL))
#define bFM4_MFS11_CSIO_STMCR_TC2              *((volatile unsigned char*)(0x42716588UL))
#define bFM4_MFS11_CSIO_STMCR_TC3              *((volatile unsigned char*)(0x4271658CUL))
#define bFM4_MFS11_CSIO_STMCR_TC4              *((volatile unsigned char*)(0x42716590UL))
#define bFM4_MFS11_CSIO_STMCR_TC5              *((volatile unsigned char*)(0x42716594UL))
#define bFM4_MFS11_CSIO_STMCR_TC6              *((volatile unsigned char*)(0x42716598UL))
#define bFM4_MFS11_CSIO_STMCR_TC7              *((volatile unsigned char*)(0x4271659CUL))
#define bFM4_MFS11_CSIO_STMCR_TC8              *((volatile unsigned char*)(0x427165A0UL))
#define bFM4_MFS11_CSIO_STMCR_TC9              *((volatile unsigned char*)(0x427165A4UL))
#define bFM4_MFS11_CSIO_STMCR_TC10             *((volatile unsigned char*)(0x427165A8UL))
#define bFM4_MFS11_CSIO_STMCR_TC11             *((volatile unsigned char*)(0x427165ACUL))
#define bFM4_MFS11_CSIO_STMCR_TC12             *((volatile unsigned char*)(0x427165B0UL))
#define bFM4_MFS11_CSIO_STMCR_TC13             *((volatile unsigned char*)(0x427165B4UL))
#define bFM4_MFS11_CSIO_STMCR_TC14             *((volatile unsigned char*)(0x427165B8UL))
#define bFM4_MFS11_CSIO_STMCR_TC15             *((volatile unsigned char*)(0x427165BCUL))
#define bFM4_MFS11_CSIO_SCSCR_CSOE             *((volatile unsigned char*)(0x42716600UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN0            *((volatile unsigned char*)(0x42716604UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN1            *((volatile unsigned char*)(0x42716608UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN2            *((volatile unsigned char*)(0x4271660CUL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN3            *((volatile unsigned char*)(0x42716610UL))
#define bFM4_MFS11_CSIO_SCSCR_CSLVL            *((volatile unsigned char*)(0x42716614UL))
#define bFM4_MFS11_CSIO_SCSCR_CDIV0            *((volatile unsigned char*)(0x42716618UL))
#define bFM4_MFS11_CSIO_SCSCR_CDIV1            *((volatile unsigned char*)(0x4271661CUL))
#define bFM4_MFS11_CSIO_SCSCR_CDIV2            *((volatile unsigned char*)(0x42716620UL))
#define bFM4_MFS11_CSIO_SCSCR_SCAM             *((volatile unsigned char*)(0x42716624UL))
#define bFM4_MFS11_CSIO_SCSCR_SCD0             *((volatile unsigned char*)(0x42716628UL))
#define bFM4_MFS11_CSIO_SCSCR_SCD1             *((volatile unsigned char*)(0x4271662CUL))
#define bFM4_MFS11_CSIO_SCSCR_SED0             *((volatile unsigned char*)(0x42716630UL))
#define bFM4_MFS11_CSIO_SCSCR_SED1             *((volatile unsigned char*)(0x42716634UL))
#define bFM4_MFS11_CSIO_SCSCR_SST0             *((volatile unsigned char*)(0x42716638UL))
#define bFM4_MFS11_CSIO_SCSCR_SST1             *((volatile unsigned char*)(0x4271663CUL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1L0           *((volatile unsigned char*)(0x42716680UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1L1           *((volatile unsigned char*)(0x42716684UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1L2           *((volatile unsigned char*)(0x42716688UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1L3           *((volatile unsigned char*)(0x4271668CUL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1L4           *((volatile unsigned char*)(0x42716690UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SPI          *((volatile unsigned char*)(0x42716694UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned char*)(0x42716698UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned char*)(0x4271669CUL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2L0           *((volatile unsigned char*)(0x427166A0UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2L1           *((volatile unsigned char*)(0x427166A4UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2L2           *((volatile unsigned char*)(0x427166A8UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2L3           *((volatile unsigned char*)(0x427166ACUL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2L4           *((volatile unsigned char*)(0x427166B0UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SPI          *((volatile unsigned char*)(0x427166B4UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned char*)(0x427166B8UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned char*)(0x427166BCUL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3L0           *((volatile unsigned char*)(0x42716700UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3L1           *((volatile unsigned char*)(0x42716704UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3L2           *((volatile unsigned char*)(0x42716708UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3L3           *((volatile unsigned char*)(0x4271670CUL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3L4           *((volatile unsigned char*)(0x42716710UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SPI          *((volatile unsigned char*)(0x42716714UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SCINV        *((volatile unsigned char*)(0x42716718UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3CSLVL        *((volatile unsigned char*)(0x4271671CUL))

