MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* MFS CSIO channel 12 registers */
#define bFM4_MFS12_CSIO_SMR_SOE                *((volatile unsigned char*)(0x42718000UL))
#define bFM4_MFS12_CSIO_SMR_SCKE               *((volatile unsigned char*)(0x42718004UL))
#define bFM4_MFS12_CSIO_SMR_BDS                *((volatile unsigned char*)(0x42718008UL))
#define bFM4_MFS12_CSIO_SMR_SCINV              *((volatile unsigned char*)(0x4271800CUL))
#define bFM4_MFS12_CSIO_SMR_MD0                *((volatile unsigned char*)(0x42718014UL))
#define bFM4_MFS12_CSIO_SMR_MD1                *((volatile unsigned char*)(0x42718018UL))
#define bFM4_MFS12_CSIO_SMR_MD2                *((volatile unsigned char*)(0x4271801CUL))
#define bFM4_MFS12_CSIO_SCR_TXE                *((volatile unsigned char*)(0x42718020UL))
#define bFM4_MFS12_CSIO_SCR_RXE                *((volatile unsigned char*)(0x42718024UL))
#define bFM4_MFS12_CSIO_SCR_TBIE               *((volatile unsigned char*)(0x42718028UL))
#define bFM4_MFS12_CSIO_SCR_TIE                *((volatile unsigned char*)(0x4271802CUL))
#define bFM4_MFS12_CSIO_SCR_RIE                *((volatile unsigned char*)(0x42718030UL))
#define bFM4_MFS12_CSIO_SCR_SPI                *((volatile unsigned char*)(0x42718034UL))
#define bFM4_MFS12_CSIO_SCR_MS                 *((volatile unsigned char*)(0x42718038UL))
#define bFM4_MFS12_CSIO_SCR_UPCL               *((volatile unsigned char*)(0x4271803CUL))
#define bFM4_MFS12_CSIO_ESCR_L0                *((volatile unsigned char*)(0x42718080UL))
#define bFM4_MFS12_CSIO_ESCR_L1                *((volatile unsigned char*)(0x42718084UL))
#define bFM4_MFS12_CSIO_ESCR_L2                *((volatile unsigned char*)(0x42718088UL))
#define bFM4_MFS12_CSIO_ESCR_WT0               *((volatile unsigned char*)(0x4271808CUL))
#define bFM4_MFS12_CSIO_ESCR_WT1               *((volatile unsigned char*)(0x42718090UL))
#define bFM4_MFS12_CSIO_ESCR_CSFE              *((volatile unsigned char*)(0x42718094UL))
#define bFM4_MFS12_CSIO_ESCR_L3                *((volatile unsigned char*)(0x42718098UL))
#define bFM4_MFS12_CSIO_ESCR_SOP               *((volatile unsigned char*)(0x4271809CUL))
#define bFM4_MFS12_CSIO_SSR_TBI                *((volatile unsigned char*)(0x427180A0UL))
#define bFM4_MFS12_CSIO_SSR_TDRE               *((volatile unsigned char*)(0x427180A4UL))
#define bFM4_MFS12_CSIO_SSR_RDRF               *((volatile unsigned char*)(0x427180A8UL))
#define bFM4_MFS12_CSIO_SSR_ORE                *((volatile unsigned char*)(0x427180ACUL))
#define bFM4_MFS12_CSIO_SSR_AWC                *((volatile unsigned char*)(0x427180B0UL))
#define bFM4_MFS12_CSIO_SSR_REC                *((volatile unsigned char*)(0x427180BCUL))
#define bFM4_MFS12_CSIO_FCR_FE1                *((volatile unsigned char*)(0x42718280UL))
#define bFM4_MFS12_CSIO_FCR_FE2                *((volatile unsigned char*)(0x42718284UL))
#define bFM4_MFS12_CSIO_FCR_FCL1               *((volatile unsigned char*)(0x42718288UL))
#define bFM4_MFS12_CSIO_FCR_FCL2               *((volatile unsigned char*)(0x4271828CUL))
#define bFM4_MFS12_CSIO_FCR_FSET               *((volatile unsigned char*)(0x42718290UL))
#define bFM4_MFS12_CSIO_FCR_FLD                *((volatile unsigned char*)(0x42718294UL))
#define bFM4_MFS12_CSIO_FCR_FLST               *((volatile unsigned char*)(0x42718298UL))
#define bFM4_MFS12_CSIO_FCR_FSEL               *((volatile unsigned char*)(0x427182A0UL))
#define bFM4_MFS12_CSIO_FCR_FTIE               *((volatile unsigned char*)(0x427182A4UL))
#define bFM4_MFS12_CSIO_FCR_FDRQ               *((volatile unsigned char*)(0x427182A8UL))
#define bFM4_MFS12_CSIO_FCR_FRIIE              *((volatile unsigned char*)(0x427182ACUL))
#define bFM4_MFS12_CSIO_FCR_FLSTE              *((volatile unsigned char*)(0x427182B0UL))
#define bFM4_MFS12_CSIO_FCR0_FE1               *((volatile unsigned char*)(0x42718280UL))
#define bFM4_MFS12_CSIO_FCR0_FE2               *((volatile unsigned char*)(0x42718284UL))
#define bFM4_MFS12_CSIO_FCR0_FCL1              *((volatile unsigned char*)(0x42718288UL))
#define bFM4_MFS12_CSIO_FCR0_FCL2              *((volatile unsigned char*)(0x4271828CUL))
#define bFM4_MFS12_CSIO_FCR0_FSET              *((volatile unsigned char*)(0x42718290UL))
#define bFM4_MFS12_CSIO_FCR0_FLD               *((volatile unsigned char*)(0x42718294UL))
#define bFM4_MFS12_CSIO_FCR0_FLST              *((volatile unsigned char*)(0x42718298UL))
#define bFM4_MFS12_CSIO_FCR1_FSEL              *((volatile unsigned char*)(0x427182A0UL))
#define bFM4_MFS12_CSIO_FCR1_FTIE              *((volatile unsigned char*)(0x427182A4UL))
#define bFM4_MFS12_CSIO_FCR1_FDRQ              *((volatile unsigned char*)(0x427182A8UL))
#define bFM4_MFS12_CSIO_FCR1_FRIIE             *((volatile unsigned char*)(0x427182ACUL))
#define bFM4_MFS12_CSIO_FCR1_FLSTE             *((volatile unsigned char*)(0x427182B0UL))
#define bFM4_MFS12_CSIO_FBYTE_FD0              *((volatile unsigned char*)(0x42718300UL))
#define bFM4_MFS12_CSIO_FBYTE_FD1              *((volatile unsigned char*)(0x42718304UL))
#define bFM4_MFS12_CSIO_FBYTE_FD2              *((volatile unsigned char*)(0x42718308UL))
#define bFM4_MFS12_CSIO_FBYTE_FD3              *((volatile unsigned char*)(0x4271830CUL))
#define bFM4_MFS12_CSIO_FBYTE_FD4              *((volatile unsigned char*)(0x42718310UL))
#define bFM4_MFS12_CSIO_FBYTE_FD5              *((volatile unsigned char*)(0x42718314UL))
#define bFM4_MFS12_CSIO_FBYTE_FD6              *((volatile unsigned char*)(0x42718318UL))
#define bFM4_MFS12_CSIO_FBYTE_FD7              *((volatile unsigned char*)(0x4271831CUL))
#define bFM4_MFS12_CSIO_FBYTE_FD8              *((volatile unsigned char*)(0x42718320UL))
#define bFM4_MFS12_CSIO_FBYTE_FD9              *((volatile unsigned char*)(0x42718324UL))
#define bFM4_MFS12_CSIO_FBYTE_FD10             *((volatile unsigned char*)(0x42718328UL))
#define bFM4_MFS12_CSIO_FBYTE_FD11             *((volatile unsigned char*)(0x4271832CUL))
#define bFM4_MFS12_CSIO_FBYTE_FD12             *((volatile unsigned char*)(0x42718330UL))
#define bFM4_MFS12_CSIO_FBYTE_FD13             *((volatile unsigned char*)(0x42718334UL))
#define bFM4_MFS12_CSIO_FBYTE_FD14             *((volatile unsigned char*)(0x42718338UL))
#define bFM4_MFS12_CSIO_FBYTE_FD15             *((volatile unsigned char*)(0x4271833CUL))
#define bFM4_MFS12_CSIO_FBYTE1_FD0             *((volatile unsigned char*)(0x42718300UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD1             *((volatile unsigned char*)(0x42718304UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD2             *((volatile unsigned char*)(0x42718308UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD3             *((volatile unsigned char*)(0x4271830CUL))
#define bFM4_MFS12_CSIO_FBYTE1_FD4             *((volatile unsigned char*)(0x42718310UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD5             *((volatile unsigned char*)(0x42718314UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD6             *((volatile unsigned char*)(0x42718318UL))
#define bFM4_MFS12_CSIO_FBYTE1_FD7             *((volatile unsigned char*)(0x4271831CUL))
#define bFM4_MFS12_CSIO_FBYTE2_FD8             *((volatile unsigned char*)(0x42718320UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD9             *((volatile unsigned char*)(0x42718324UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD10            *((volatile unsigned char*)(0x42718328UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD11            *((volatile unsigned char*)(0x4271832CUL))
#define bFM4_MFS12_CSIO_FBYTE2_FD12            *((volatile unsigned char*)(0x42718330UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD13            *((volatile unsigned char*)(0x42718334UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD14            *((volatile unsigned char*)(0x42718338UL))
#define bFM4_MFS12_CSIO_FBYTE2_FD15            *((volatile unsigned char*)(0x4271833CUL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD0          *((volatile unsigned char*)(0x42718380UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD1          *((volatile unsigned char*)(0x42718384UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD2          *((volatile unsigned char*)(0x42718388UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD3          *((volatile unsigned char*)(0x4271838CUL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD4          *((volatile unsigned char*)(0x42718390UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD5          *((volatile unsigned char*)(0x42718394UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD6          *((volatile unsigned char*)(0x42718398UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSHD7          *((volatile unsigned char*)(0x4271839CUL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU0          *((volatile unsigned char*)(0x427183A0UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU1          *((volatile unsigned char*)(0x427183A4UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU2          *((volatile unsigned char*)(0x427183A8UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU3          *((volatile unsigned char*)(0x427183ACUL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU4          *((volatile unsigned char*)(0x427183B0UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU5          *((volatile unsigned char*)(0x427183B4UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU6          *((volatile unsigned char*)(0x427183B8UL))
#define bFM4_MFS12_CSIO_SCSTR10_CSSU7          *((volatile unsigned char*)(0x427183BCUL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS0          *((volatile unsigned char*)(0x42718400UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS1          *((volatile unsigned char*)(0x42718404UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS2          *((volatile unsigned char*)(0x42718408UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS3          *((volatile unsigned char*)(0x4271840CUL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS4          *((volatile unsigned char*)(0x42718410UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS5          *((volatile unsigned char*)(0x42718414UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS6          *((volatile unsigned char*)(0x42718418UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS7          *((volatile unsigned char*)(0x4271841CUL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS8          *((volatile unsigned char*)(0x42718420UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS9          *((volatile unsigned char*)(0x42718424UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS10         *((volatile unsigned char*)(0x42718428UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS11         *((volatile unsigned char*)(0x4271842CUL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS12         *((volatile unsigned char*)(0x42718430UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS13         *((volatile unsigned char*)(0x42718434UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS14         *((volatile unsigned char*)(0x42718438UL))
#define bFM4_MFS12_CSIO_SCSTR32_CSDS15         *((volatile unsigned char*)(0x4271843CUL))
#define bFM4_MFS12_CSIO_SACSR_TMRE             *((volatile unsigned char*)(0x42718480UL))
#define bFM4_MFS12_CSIO_SACSR_TDIV0            *((volatile unsigned char*)(0x42718484UL))
#define bFM4_MFS12_CSIO_SACSR_TDIV1            *((volatile unsigned char*)(0x42718488UL))
#define bFM4_MFS12_CSIO_SACSR_TDIV2            *((volatile unsigned char*)(0x4271848CUL))
#define bFM4_MFS12_CSIO_SACSR_TDIV3            *((volatile unsigned char*)(0x42718490UL))
#define bFM4_MFS12_CSIO_SACSR_TSYNE            *((volatile unsigned char*)(0x42718498UL))
#define bFM4_MFS12_CSIO_SACSR_TINTE            *((volatile unsigned char*)(0x4271849CUL))
#define bFM4_MFS12_CSIO_SACSR_TINT             *((volatile unsigned char*)(0x427184A0UL))
#define bFM4_MFS12_CSIO_SACSR_CSE              *((volatile unsigned char*)(0x427184ACUL))
#define bFM4_MFS12_CSIO_SACSR_CSEIE            *((volatile unsigned char*)(0x427184B0UL))
#define bFM4_MFS12_CSIO_SACSR_TBEEN            *((volatile unsigned char*)(0x427184B4UL))
#define bFM4_MFS12_CSIO_STMR_TM0               *((volatile unsigned char*)(0x42718500UL))
#define bFM4_MFS12_CSIO_STMR_TM1               *((volatile unsigned char*)(0x42718504UL))
#define bFM4_MFS12_CSIO_STMR_TM2               *((volatile unsigned char*)(0x42718508UL))
#define bFM4_MFS12_CSIO_STMR_TM3               *((volatile unsigned char*)(0x4271850CUL))
#define bFM4_MFS12_CSIO_STMR_TM4               *((volatile unsigned char*)(0x42718510UL))
#define bFM4_MFS12_CSIO_STMR_TM5               *((volatile unsigned char*)(0x42718514UL))
#define bFM4_MFS12_CSIO_STMR_TM6               *((volatile unsigned char*)(0x42718518UL))
#define bFM4_MFS12_CSIO_STMR_TM7               *((volatile unsigned char*)(0x4271851CUL))
#define bFM4_MFS12_CSIO_STMR_TM8               *((volatile unsigned char*)(0x42718520UL))
#define bFM4_MFS12_CSIO_STMR_TM9               *((volatile unsigned char*)(0x42718524UL))
#define bFM4_MFS12_CSIO_STMR_TM10              *((volatile unsigned char*)(0x42718528UL))
#define bFM4_MFS12_CSIO_STMR_TM11              *((volatile unsigned char*)(0x4271852CUL))
#define bFM4_MFS12_CSIO_STMR_TM12              *((volatile unsigned char*)(0x42718530UL))
#define bFM4_MFS12_CSIO_STMR_TM13              *((volatile unsigned char*)(0x42718534UL))
#define bFM4_MFS12_CSIO_STMR_TM14              *((volatile unsigned char*)(0x42718538UL))
#define bFM4_MFS12_CSIO_STMR_TM15              *((volatile unsigned char*)(0x4271853CUL))
#define bFM4_MFS12_CSIO_STMCR_TC0              *((volatile unsigned char*)(0x42718580UL))
#define bFM4_MFS12_CSIO_STMCR_TC1              *((volatile unsigned char*)(0x42718584UL))
#define bFM4_MFS12_CSIO_STMCR_TC2              *((volatile unsigned char*)(0x42718588UL))
#define bFM4_MFS12_CSIO_STMCR_TC3              *((volatile unsigned char*)(0x4271858CUL))
#define bFM4_MFS12_CSIO_STMCR_TC4              *((volatile unsigned char*)(0x42718590UL))
#define bFM4_MFS12_CSIO_STMCR_TC5              *((volatile unsigned char*)(0x42718594UL))
#define bFM4_MFS12_CSIO_STMCR_TC6              *((volatile unsigned char*)(0x42718598UL))
#define bFM4_MFS12_CSIO_STMCR_TC7              *((volatile unsigned char*)(0x4271859CUL))
#define bFM4_MFS12_CSIO_STMCR_TC8              *((volatile unsigned char*)(0x427185A0UL))
#define bFM4_MFS12_CSIO_STMCR_TC9              *((volatile unsigned char*)(0x427185A4UL))
#define bFM4_MFS12_CSIO_STMCR_TC10             *((volatile unsigned char*)(0x427185A8UL))
#define bFM4_MFS12_CSIO_STMCR_TC11             *((volatile unsigned char*)(0x427185ACUL))
#define bFM4_MFS12_CSIO_STMCR_TC12             *((volatile unsigned char*)(0x427185B0UL))
#define bFM4_MFS12_CSIO_STMCR_TC13             *((volatile unsigned char*)(0x427185B4UL))
#define bFM4_MFS12_CSIO_STMCR_TC14             *((volatile unsigned char*)(0x427185B8UL))
#define bFM4_MFS12_CSIO_STMCR_TC15             *((volatile unsigned char*)(0x427185BCUL))
#define bFM4_MFS12_CSIO_SCSCR_CSOE             *((volatile unsigned char*)(0x42718600UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN0            *((volatile unsigned char*)(0x42718604UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN1            *((volatile unsigned char*)(0x42718608UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN2            *((volatile unsigned char*)(0x4271860CUL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN3            *((volatile unsigned char*)(0x42718610UL))
#define bFM4_MFS12_CSIO_SCSCR_CSLVL            *((volatile unsigned char*)(0x42718614UL))
#define bFM4_MFS12_CSIO_SCSCR_CDIV0            *((volatile unsigned char*)(0x42718618UL))
#define bFM4_MFS12_CSIO_SCSCR_CDIV1            *((volatile unsigned char*)(0x4271861CUL))
#define bFM4_MFS12_CSIO_SCSCR_CDIV2            *((volatile unsigned char*)(0x42718620UL))
#define bFM4_MFS12_CSIO_SCSCR_SCAM             *((volatile unsigned char*)(0x42718624UL))
#define bFM4_MFS12_CSIO_SCSCR_SCD0             *((volatile unsigned char*)(0x42718628UL))
#define bFM4_MFS12_CSIO_SCSCR_SCD1             *((volatile unsigned char*)(0x4271862CUL))
#define bFM4_MFS12_CSIO_SCSCR_SED0             *((volatile unsigned char*)(0x42718630UL))
#define bFM4_MFS12_CSIO_SCSCR_SED1             *((volatile unsigned char*)(0x42718634UL))
#define bFM4_MFS12_CSIO_SCSCR_SST0             *((volatile unsigned char*)(0x42718638UL))
#define bFM4_MFS12_CSIO_SCSCR_SST1             *((volatile unsigned char*)(0x4271863CUL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1L0           *((volatile unsigned char*)(0x42718680UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1L1           *((volatile unsigned char*)(0x42718684UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1L2           *((volatile unsigned char*)(0x42718688UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1L3           *((volatile unsigned char*)(0x4271868CUL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1L4           *((volatile unsigned char*)(0x42718690UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SPI          *((volatile unsigned char*)(0x42718694UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned char*)(0x42718698UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned char*)(0x4271869CUL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2L0           *((volatile unsigned char*)(0x427186A0UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2L1           *((volatile unsigned char*)(0x427186A4UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2L2           *((volatile unsigned char*)(0x427186A8UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2L3           *((volatile unsigned char*)(0x427186ACUL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2L4           *((volatile unsigned char*)(0x427186B0UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SPI          *((volatile unsigned char*)(0x427186B4UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned char*)(0x427186B8UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned char*)(0x427186BCUL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3L0           *((volatile unsigned char*)(0x42718700UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3L1           *((volatile unsigned char*)(0x42718704UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3L2           *((volatile unsigned char*)(0x42718708UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3L3           *((volatile unsigned char*)(0x4271870CUL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3L4           *((volatile unsigned char*)(0x42718710UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SPI          *((volatile unsigned char*)(0x42718714UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SCINV        *((volatile unsigned char*)(0x42718718UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3CSLVL        *((volatile unsigned char*)(0x4271871CUL))

