MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* MFS CSIO channel 13 registers */
#define bFM4_MFS13_CSIO_SMR_SOE                *((volatile unsigned char*)(0x4271A000UL))
#define bFM4_MFS13_CSIO_SMR_SCKE               *((volatile unsigned char*)(0x4271A004UL))
#define bFM4_MFS13_CSIO_SMR_BDS                *((volatile unsigned char*)(0x4271A008UL))
#define bFM4_MFS13_CSIO_SMR_SCINV              *((volatile unsigned char*)(0x4271A00CUL))
#define bFM4_MFS13_CSIO_SMR_MD0                *((volatile unsigned char*)(0x4271A014UL))
#define bFM4_MFS13_CSIO_SMR_MD1                *((volatile unsigned char*)(0x4271A018UL))
#define bFM4_MFS13_CSIO_SMR_MD2                *((volatile unsigned char*)(0x4271A01CUL))
#define bFM4_MFS13_CSIO_SCR_TXE                *((volatile unsigned char*)(0x4271A020UL))
#define bFM4_MFS13_CSIO_SCR_RXE                *((volatile unsigned char*)(0x4271A024UL))
#define bFM4_MFS13_CSIO_SCR_TBIE               *((volatile unsigned char*)(0x4271A028UL))
#define bFM4_MFS13_CSIO_SCR_TIE                *((volatile unsigned char*)(0x4271A02CUL))
#define bFM4_MFS13_CSIO_SCR_RIE                *((volatile unsigned char*)(0x4271A030UL))
#define bFM4_MFS13_CSIO_SCR_SPI                *((volatile unsigned char*)(0x4271A034UL))
#define bFM4_MFS13_CSIO_SCR_MS                 *((volatile unsigned char*)(0x4271A038UL))
#define bFM4_MFS13_CSIO_SCR_UPCL               *((volatile unsigned char*)(0x4271A03CUL))
#define bFM4_MFS13_CSIO_ESCR_L0                *((volatile unsigned char*)(0x4271A080UL))
#define bFM4_MFS13_CSIO_ESCR_L1                *((volatile unsigned char*)(0x4271A084UL))
#define bFM4_MFS13_CSIO_ESCR_L2                *((volatile unsigned char*)(0x4271A088UL))
#define bFM4_MFS13_CSIO_ESCR_WT0               *((volatile unsigned char*)(0x4271A08CUL))
#define bFM4_MFS13_CSIO_ESCR_WT1               *((volatile unsigned char*)(0x4271A090UL))
#define bFM4_MFS13_CSIO_ESCR_CSFE              *((volatile unsigned char*)(0x4271A094UL))
#define bFM4_MFS13_CSIO_ESCR_L3                *((volatile unsigned char*)(0x4271A098UL))
#define bFM4_MFS13_CSIO_ESCR_SOP               *((volatile unsigned char*)(0x4271A09CUL))
#define bFM4_MFS13_CSIO_SSR_TBI                *((volatile unsigned char*)(0x4271A0A0UL))
#define bFM4_MFS13_CSIO_SSR_TDRE               *((volatile unsigned char*)(0x4271A0A4UL))
#define bFM4_MFS13_CSIO_SSR_RDRF               *((volatile unsigned char*)(0x4271A0A8UL))
#define bFM4_MFS13_CSIO_SSR_ORE                *((volatile unsigned char*)(0x4271A0ACUL))
#define bFM4_MFS13_CSIO_SSR_AWC                *((volatile unsigned char*)(0x4271A0B0UL))
#define bFM4_MFS13_CSIO_SSR_REC                *((volatile unsigned char*)(0x4271A0BCUL))
#define bFM4_MFS13_CSIO_FCR_FE1                *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_CSIO_FCR_FE2                *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_CSIO_FCR_FCL1               *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_CSIO_FCR_FCL2               *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_CSIO_FCR_FSET               *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_CSIO_FCR_FLD                *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_CSIO_FCR_FLST               *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_CSIO_FCR_FSEL               *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_CSIO_FCR_FTIE               *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_CSIO_FCR_FDRQ               *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_CSIO_FCR_FRIIE              *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_CSIO_FCR_FLSTE              *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_CSIO_FCR0_FE1               *((volatile unsigned char*)(0x4271A280UL))
#define bFM4_MFS13_CSIO_FCR0_FE2               *((volatile unsigned char*)(0x4271A284UL))
#define bFM4_MFS13_CSIO_FCR0_FCL1              *((volatile unsigned char*)(0x4271A288UL))
#define bFM4_MFS13_CSIO_FCR0_FCL2              *((volatile unsigned char*)(0x4271A28CUL))
#define bFM4_MFS13_CSIO_FCR0_FSET              *((volatile unsigned char*)(0x4271A290UL))
#define bFM4_MFS13_CSIO_FCR0_FLD               *((volatile unsigned char*)(0x4271A294UL))
#define bFM4_MFS13_CSIO_FCR0_FLST              *((volatile unsigned char*)(0x4271A298UL))
#define bFM4_MFS13_CSIO_FCR1_FSEL              *((volatile unsigned char*)(0x4271A2A0UL))
#define bFM4_MFS13_CSIO_FCR1_FTIE              *((volatile unsigned char*)(0x4271A2A4UL))
#define bFM4_MFS13_CSIO_FCR1_FDRQ              *((volatile unsigned char*)(0x4271A2A8UL))
#define bFM4_MFS13_CSIO_FCR1_FRIIE             *((volatile unsigned char*)(0x4271A2ACUL))
#define bFM4_MFS13_CSIO_FCR1_FLSTE             *((volatile unsigned char*)(0x4271A2B0UL))
#define bFM4_MFS13_CSIO_FBYTE_FD0              *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_CSIO_FBYTE_FD1              *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_CSIO_FBYTE_FD2              *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_CSIO_FBYTE_FD3              *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_CSIO_FBYTE_FD4              *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_CSIO_FBYTE_FD5              *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_CSIO_FBYTE_FD6              *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_CSIO_FBYTE_FD7              *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_CSIO_FBYTE_FD8              *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_CSIO_FBYTE_FD9              *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_CSIO_FBYTE_FD10             *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_CSIO_FBYTE_FD11             *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_CSIO_FBYTE_FD12             *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_CSIO_FBYTE_FD13             *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_CSIO_FBYTE_FD14             *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_CSIO_FBYTE_FD15             *((volatile unsigned char*)(0x4271A33CUL))
#define bFM4_MFS13_CSIO_FBYTE1_FD0             *((volatile unsigned char*)(0x4271A300UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD1             *((volatile unsigned char*)(0x4271A304UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD2             *((volatile unsigned char*)(0x4271A308UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD3             *((volatile unsigned char*)(0x4271A30CUL))
#define bFM4_MFS13_CSIO_FBYTE1_FD4             *((volatile unsigned char*)(0x4271A310UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD5             *((volatile unsigned char*)(0x4271A314UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD6             *((volatile unsigned char*)(0x4271A318UL))
#define bFM4_MFS13_CSIO_FBYTE1_FD7             *((volatile unsigned char*)(0x4271A31CUL))
#define bFM4_MFS13_CSIO_FBYTE2_FD8             *((volatile unsigned char*)(0x4271A320UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD9             *((volatile unsigned char*)(0x4271A324UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD10            *((volatile unsigned char*)(0x4271A328UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD11            *((volatile unsigned char*)(0x4271A32CUL))
#define bFM4_MFS13_CSIO_FBYTE2_FD12            *((volatile unsigned char*)(0x4271A330UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD13            *((volatile unsigned char*)(0x4271A334UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD14            *((volatile unsigned char*)(0x4271A338UL))
#define bFM4_MFS13_CSIO_FBYTE2_FD15            *((volatile unsigned char*)(0x4271A33CUL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD0          *((volatile unsigned char*)(0x4271A380UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD1          *((volatile unsigned char*)(0x4271A384UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD2          *((volatile unsigned char*)(0x4271A388UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD3          *((volatile unsigned char*)(0x4271A38CUL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD4          *((volatile unsigned char*)(0x4271A390UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD5          *((volatile unsigned char*)(0x4271A394UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD6          *((volatile unsigned char*)(0x4271A398UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSHD7          *((volatile unsigned char*)(0x4271A39CUL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU0          *((volatile unsigned char*)(0x4271A3A0UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU1          *((volatile unsigned char*)(0x4271A3A4UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU2          *((volatile unsigned char*)(0x4271A3A8UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU3          *((volatile unsigned char*)(0x4271A3ACUL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU4          *((volatile unsigned char*)(0x4271A3B0UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU5          *((volatile unsigned char*)(0x4271A3B4UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU6          *((volatile unsigned char*)(0x4271A3B8UL))
#define bFM4_MFS13_CSIO_SCSTR10_CSSU7          *((volatile unsigned char*)(0x4271A3BCUL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS0          *((volatile unsigned char*)(0x4271A400UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS1          *((volatile unsigned char*)(0x4271A404UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS2          *((volatile unsigned char*)(0x4271A408UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS3          *((volatile unsigned char*)(0x4271A40CUL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS4          *((volatile unsigned char*)(0x4271A410UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS5          *((volatile unsigned char*)(0x4271A414UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS6          *((volatile unsigned char*)(0x4271A418UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS7          *((volatile unsigned char*)(0x4271A41CUL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS8          *((volatile unsigned char*)(0x4271A420UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS9          *((volatile unsigned char*)(0x4271A424UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS10         *((volatile unsigned char*)(0x4271A428UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS11         *((volatile unsigned char*)(0x4271A42CUL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS12         *((volatile unsigned char*)(0x4271A430UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS13         *((volatile unsigned char*)(0x4271A434UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS14         *((volatile unsigned char*)(0x4271A438UL))
#define bFM4_MFS13_CSIO_SCSTR32_CSDS15         *((volatile unsigned char*)(0x4271A43CUL))
#define bFM4_MFS13_CSIO_SACSR_TMRE             *((volatile unsigned char*)(0x4271A480UL))
#define bFM4_MFS13_CSIO_SACSR_TDIV0            *((volatile unsigned char*)(0x4271A484UL))
#define bFM4_MFS13_CSIO_SACSR_TDIV1            *((volatile unsigned char*)(0x4271A488UL))
#define bFM4_MFS13_CSIO_SACSR_TDIV2            *((volatile unsigned char*)(0x4271A48CUL))
#define bFM4_MFS13_CSIO_SACSR_TDIV3            *((volatile unsigned char*)(0x4271A490UL))
#define bFM4_MFS13_CSIO_SACSR_TSYNE            *((volatile unsigned char*)(0x4271A498UL))
#define bFM4_MFS13_CSIO_SACSR_TINTE            *((volatile unsigned char*)(0x4271A49CUL))
#define bFM4_MFS13_CSIO_SACSR_TINT             *((volatile unsigned char*)(0x4271A4A0UL))
#define bFM4_MFS13_CSIO_SACSR_CSE              *((volatile unsigned char*)(0x4271A4ACUL))
#define bFM4_MFS13_CSIO_SACSR_CSEIE            *((volatile unsigned char*)(0x4271A4B0UL))
#define bFM4_MFS13_CSIO_SACSR_TBEEN            *((volatile unsigned char*)(0x4271A4B4UL))
#define bFM4_MFS13_CSIO_STMR_TM0               *((volatile unsigned char*)(0x4271A500UL))
#define bFM4_MFS13_CSIO_STMR_TM1               *((volatile unsigned char*)(0x4271A504UL))
#define bFM4_MFS13_CSIO_STMR_TM2               *((volatile unsigned char*)(0x4271A508UL))
#define bFM4_MFS13_CSIO_STMR_TM3               *((volatile unsigned char*)(0x4271A50CUL))
#define bFM4_MFS13_CSIO_STMR_TM4               *((volatile unsigned char*)(0x4271A510UL))
#define bFM4_MFS13_CSIO_STMR_TM5               *((volatile unsigned char*)(0x4271A514UL))
#define bFM4_MFS13_CSIO_STMR_TM6               *((volatile unsigned char*)(0x4271A518UL))
#define bFM4_MFS13_CSIO_STMR_TM7               *((volatile unsigned char*)(0x4271A51CUL))
#define bFM4_MFS13_CSIO_STMR_TM8               *((volatile unsigned char*)(0x4271A520UL))
#define bFM4_MFS13_CSIO_STMR_TM9               *((volatile unsigned char*)(0x4271A524UL))
#define bFM4_MFS13_CSIO_STMR_TM10              *((volatile unsigned char*)(0x4271A528UL))
#define bFM4_MFS13_CSIO_STMR_TM11              *((volatile unsigned char*)(0x4271A52CUL))
#define bFM4_MFS13_CSIO_STMR_TM12              *((volatile unsigned char*)(0x4271A530UL))
#define bFM4_MFS13_CSIO_STMR_TM13              *((volatile unsigned char*)(0x4271A534UL))
#define bFM4_MFS13_CSIO_STMR_TM14              *((volatile unsigned char*)(0x4271A538UL))
#define bFM4_MFS13_CSIO_STMR_TM15              *((volatile unsigned char*)(0x4271A53CUL))
#define bFM4_MFS13_CSIO_STMCR_TC0              *((volatile unsigned char*)(0x4271A580UL))
#define bFM4_MFS13_CSIO_STMCR_TC1              *((volatile unsigned char*)(0x4271A584UL))
#define bFM4_MFS13_CSIO_STMCR_TC2              *((volatile unsigned char*)(0x4271A588UL))
#define bFM4_MFS13_CSIO_STMCR_TC3              *((volatile unsigned char*)(0x4271A58CUL))
#define bFM4_MFS13_CSIO_STMCR_TC4              *((volatile unsigned char*)(0x4271A590UL))
#define bFM4_MFS13_CSIO_STMCR_TC5              *((volatile unsigned char*)(0x4271A594UL))
#define bFM4_MFS13_CSIO_STMCR_TC6              *((volatile unsigned char*)(0x4271A598UL))
#define bFM4_MFS13_CSIO_STMCR_TC7              *((volatile unsigned char*)(0x4271A59CUL))
#define bFM4_MFS13_CSIO_STMCR_TC8              *((volatile unsigned char*)(0x4271A5A0UL))
#define bFM4_MFS13_CSIO_STMCR_TC9              *((volatile unsigned char*)(0x4271A5A4UL))
#define bFM4_MFS13_CSIO_STMCR_TC10             *((volatile unsigned char*)(0x4271A5A8UL))
#define bFM4_MFS13_CSIO_STMCR_TC11             *((volatile unsigned char*)(0x4271A5ACUL))
#define bFM4_MFS13_CSIO_STMCR_TC12             *((volatile unsigned char*)(0x4271A5B0UL))
#define bFM4_MFS13_CSIO_STMCR_TC13             *((volatile unsigned char*)(0x4271A5B4UL))
#define bFM4_MFS13_CSIO_STMCR_TC14             *((volatile unsigned char*)(0x4271A5B8UL))
#define bFM4_MFS13_CSIO_STMCR_TC15             *((volatile unsigned char*)(0x4271A5BCUL))
#define bFM4_MFS13_CSIO_SCSCR_CSOE             *((volatile unsigned char*)(0x4271A600UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN0            *((volatile unsigned char*)(0x4271A604UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN1            *((volatile unsigned char*)(0x4271A608UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN2            *((volatile unsigned char*)(0x4271A60CUL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN3            *((volatile unsigned char*)(0x4271A610UL))
#define bFM4_MFS13_CSIO_SCSCR_CSLVL            *((volatile unsigned char*)(0x4271A614UL))
#define bFM4_MFS13_CSIO_SCSCR_CDIV0            *((volatile unsigned char*)(0x4271A618UL))
#define bFM4_MFS13_CSIO_SCSCR_CDIV1            *((volatile unsigned char*)(0x4271A61CUL))
#define bFM4_MFS13_CSIO_SCSCR_CDIV2            *((volatile unsigned char*)(0x4271A620UL))
#define bFM4_MFS13_CSIO_SCSCR_SCAM             *((volatile unsigned char*)(0x4271A624UL))
#define bFM4_MFS13_CSIO_SCSCR_SCD0             *((volatile unsigned char*)(0x4271A628UL))
#define bFM4_MFS13_CSIO_SCSCR_SCD1             *((volatile unsigned char*)(0x4271A62CUL))
#define bFM4_MFS13_CSIO_SCSCR_SED0             *((volatile unsigned char*)(0x4271A630UL))
#define bFM4_MFS13_CSIO_SCSCR_SED1             *((volatile unsigned char*)(0x4271A634UL))
#define bFM4_MFS13_CSIO_SCSCR_SST0             *((volatile unsigned char*)(0x4271A638UL))
#define bFM4_MFS13_CSIO_SCSCR_SST1             *((volatile unsigned char*)(0x4271A63CUL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1L0           *((volatile unsigned char*)(0x4271A680UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1L1           *((volatile unsigned char*)(0x4271A684UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1L2           *((volatile unsigned char*)(0x4271A688UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1L3           *((volatile unsigned char*)(0x4271A68CUL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1L4           *((volatile unsigned char*)(0x4271A690UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SPI          *((volatile unsigned char*)(0x4271A694UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned char*)(0x4271A698UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned char*)(0x4271A69CUL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2L0           *((volatile unsigned char*)(0x4271A6A0UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2L1           *((volatile unsigned char*)(0x4271A6A4UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2L2           *((volatile unsigned char*)(0x4271A6A8UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2L3           *((volatile unsigned char*)(0x4271A6ACUL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2L4           *((volatile unsigned char*)(0x4271A6B0UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SPI          *((volatile unsigned char*)(0x4271A6B4UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned char*)(0x4271A6B8UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned char*)(0x4271A6BCUL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3L0           *((volatile unsigned char*)(0x4271A700UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3L1           *((volatile unsigned char*)(0x4271A704UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3L2           *((volatile unsigned char*)(0x4271A708UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3L3           *((volatile unsigned char*)(0x4271A70CUL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3L4           *((volatile unsigned char*)(0x4271A710UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SPI          *((volatile unsigned char*)(0x4271A714UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SCINV        *((volatile unsigned char*)(0x4271A718UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3CSLVL        *((volatile unsigned char*)(0x4271A71CUL))

