MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C29J0AGV2000A/mcu.h
/* USB channel 1 registers */
#define bFM4_USB1_HCNT_HOST                    *((volatile unsigned char*)(0x42A42000UL))
#define bFM4_USB1_HCNT_URST                    *((volatile unsigned char*)(0x42A42004UL))
#define bFM4_USB1_HCNT_SOFIRE                  *((volatile unsigned char*)(0x42A42008UL))
#define bFM4_USB1_HCNT_DIRE                    *((volatile unsigned char*)(0x42A4200CUL))
#define bFM4_USB1_HCNT_CNNIRE                  *((volatile unsigned char*)(0x42A42010UL))
#define bFM4_USB1_HCNT_CMPIRE                  *((volatile unsigned char*)(0x42A42014UL))
#define bFM4_USB1_HCNT_URIRE                   *((volatile unsigned char*)(0x42A42018UL))
#define bFM4_USB1_HCNT_RWKIRE                  *((volatile unsigned char*)(0x42A4201CUL))
#define bFM4_USB1_HCNT_RETRY                   *((volatile unsigned char*)(0x42A42020UL))
#define bFM4_USB1_HCNT_CANCEL                  *((volatile unsigned char*)(0x42A42024UL))
#define bFM4_USB1_HCNT_SOFSTEP                 *((volatile unsigned char*)(0x42A42028UL))
#define bFM4_USB1_HCNT0_HOST                   *((volatile unsigned char*)(0x42A42000UL))
#define bFM4_USB1_HCNT0_URST                   *((volatile unsigned char*)(0x42A42004UL))
#define bFM4_USB1_HCNT0_SOFIRE                 *((volatile unsigned char*)(0x42A42008UL))
#define bFM4_USB1_HCNT0_DIRE                   *((volatile unsigned char*)(0x42A4200CUL))
#define bFM4_USB1_HCNT0_CNNIRE                 *((volatile unsigned char*)(0x42A42010UL))
#define bFM4_USB1_HCNT0_CMPIRE                 *((volatile unsigned char*)(0x42A42014UL))
#define bFM4_USB1_HCNT0_URIRE                  *((volatile unsigned char*)(0x42A42018UL))
#define bFM4_USB1_HCNT0_RWKIRE                 *((volatile unsigned char*)(0x42A4201CUL))
#define bFM4_USB1_HCNT1_RETRY                  *((volatile unsigned char*)(0x42A42020UL))
#define bFM4_USB1_HCNT1_CANCEL                 *((volatile unsigned char*)(0x42A42024UL))
#define bFM4_USB1_HCNT1_SOFSTEP                *((volatile unsigned char*)(0x42A42028UL))
#define bFM4_USB1_HIRQ_SOFIRQ                  *((volatile unsigned char*)(0x42A42080UL))
#define bFM4_USB1_HIRQ_DIRQ                    *((volatile unsigned char*)(0x42A42084UL))
#define bFM4_USB1_HIRQ_CNNIRQ                  *((volatile unsigned char*)(0x42A42088UL))
#define bFM4_USB1_HIRQ_CMPIRQ                  *((volatile unsigned char*)(0x42A4208CUL))
#define bFM4_USB1_HIRQ_URIRQ                   *((volatile unsigned char*)(0x42A42090UL))
#define bFM4_USB1_HIRQ_RWKIRQ                  *((volatile unsigned char*)(0x42A42094UL))
#define bFM4_USB1_HIRQ_TCAN                    *((volatile unsigned char*)(0x42A4209CUL))
#define bFM4_USB1_HERR_HS0                     *((volatile unsigned char*)(0x42A420A0UL))
#define bFM4_USB1_HERR_HS1                     *((volatile unsigned char*)(0x42A420A4UL))
#define bFM4_USB1_HERR_STUFF                   *((volatile unsigned char*)(0x42A420A8UL))
#define bFM4_USB1_HERR_TGERR                   *((volatile unsigned char*)(0x42A420ACUL))
#define bFM4_USB1_HERR_CRC                     *((volatile unsigned char*)(0x42A420B0UL))
#define bFM4_USB1_HERR_TOUT                    *((volatile unsigned char*)(0x42A420B4UL))
#define bFM4_USB1_HERR_RERR                    *((volatile unsigned char*)(0x42A420B8UL))
#define bFM4_USB1_HERR_LSTOF                   *((volatile unsigned char*)(0x42A420BCUL))
#define bFM4_USB1_HSTATE_CSTAT                 *((volatile unsigned char*)(0x42A42100UL))
#define bFM4_USB1_HSTATE_TMODE                 *((volatile unsigned char*)(0x42A42104UL))
#define bFM4_USB1_HSTATE_SUSP                  *((volatile unsigned char*)(0x42A42108UL))
#define bFM4_USB1_HSTATE_SOFBUSY               *((volatile unsigned char*)(0x42A4210CUL))
#define bFM4_USB1_HSTATE_CLKSEL                *((volatile unsigned char*)(0x42A42110UL))
#define bFM4_USB1_HSTATE_ALIVE                 *((volatile unsigned char*)(0x42A42114UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP0            *((volatile unsigned char*)(0x42A42120UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP1            *((volatile unsigned char*)(0x42A42124UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP2            *((volatile unsigned char*)(0x42A42128UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP3            *((volatile unsigned char*)(0x42A4212CUL))
#define bFM4_USB1_HFCOMP_FRAMECOMP4            *((volatile unsigned char*)(0x42A42130UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP5            *((volatile unsigned char*)(0x42A42134UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP6            *((volatile unsigned char*)(0x42A42138UL))
#define bFM4_USB1_HFCOMP_FRAMECOMP7            *((volatile unsigned char*)(0x42A4213CUL))
#define bFM4_USB1_HRTIMER_RTIMER0              *((volatile unsigned char*)(0x42A42180UL))
#define bFM4_USB1_HRTIMER_RTIMER1              *((volatile unsigned char*)(0x42A42184UL))
#define bFM4_USB1_HRTIMER_RTIMER2              *((volatile unsigned char*)(0x42A42188UL))
#define bFM4_USB1_HRTIMER_RTIMER3              *((volatile unsigned char*)(0x42A4218CUL))
#define bFM4_USB1_HRTIMER_RTIMER4              *((volatile unsigned char*)(0x42A42190UL))
#define bFM4_USB1_HRTIMER_RTIMER5              *((volatile unsigned char*)(0x42A42194UL))
#define bFM4_USB1_HRTIMER_RTIMER6              *((volatile unsigned char*)(0x42A42198UL))
#define bFM4_USB1_HRTIMER_RTIMER7              *((volatile unsigned char*)(0x42A4219CUL))
#define bFM4_USB1_HRTIMER_RTIMER8              *((volatile unsigned char*)(0x42A421A0UL))
#define bFM4_USB1_HRTIMER_RTIMER9              *((volatile unsigned char*)(0x42A421A4UL))
#define bFM4_USB1_HRTIMER_RTIMER10             *((volatile unsigned char*)(0x42A421A8UL))
#define bFM4_USB1_HRTIMER_RTIMER11             *((volatile unsigned char*)(0x42A421ACUL))
#define bFM4_USB1_HRTIMER_RTIMER12             *((volatile unsigned char*)(0x42A421B0UL))
#define bFM4_USB1_HRTIMER_RTIMER13             *((volatile unsigned char*)(0x42A421B4UL))
#define bFM4_USB1_HRTIMER_RTIMER14             *((volatile unsigned char*)(0x42A421B8UL))
#define bFM4_USB1_HRTIMER_RTIMER15             *((volatile unsigned char*)(0x42A421BCUL))
#define bFM4_USB1_HRTIMER0_RTIMER00            *((volatile unsigned char*)(0x42A42180UL))
#define bFM4_USB1_HRTIMER0_RTIMER01            *((volatile unsigned char*)(0x42A42184UL))
#define bFM4_USB1_HRTIMER0_RTIMER02            *((volatile unsigned char*)(0x42A42188UL))
#define bFM4_USB1_HRTIMER0_RTIMER03            *((volatile unsigned char*)(0x42A4218CUL))
#define bFM4_USB1_HRTIMER0_RTIMER04            *((volatile unsigned char*)(0x42A42190UL))
#define bFM4_USB1_HRTIMER0_RTIMER05            *((volatile unsigned char*)(0x42A42194UL))
#define bFM4_USB1_HRTIMER0_RTIMER06            *((volatile unsigned char*)(0x42A42198UL))
#define bFM4_USB1_HRTIMER0_RTIMER07            *((volatile unsigned char*)(0x42A4219CUL))
#define bFM4_USB1_HRTIMER1_RTIMER10            *((volatile unsigned char*)(0x42A421A0UL))
#define bFM4_USB1_HRTIMER1_RTIMER11            *((volatile unsigned char*)(0x42A421A4UL))
#define bFM4_USB1_HRTIMER1_RTIMER12            *((volatile unsigned char*)(0x42A421A8UL))
#define bFM4_USB1_HRTIMER1_RTIMER13            *((volatile unsigned char*)(0x42A421ACUL))
#define bFM4_USB1_HRTIMER1_RTIMER14            *((volatile unsigned char*)(0x42A421B0UL))
#define bFM4_USB1_HRTIMER1_RTIMER15            *((volatile unsigned char*)(0x42A421B4UL))
#define bFM4_USB1_HRTIMER1_RTIMER16            *((volatile unsigned char*)(0x42A421B8UL))
#define bFM4_USB1_HRTIMER1_RTIMER17            *((volatile unsigned char*)(0x42A421BCUL))
#define bFM4_USB1_HRTIMER2_RTIMER20            *((volatile unsigned char*)(0x42A42200UL))
#define bFM4_USB1_HRTIMER2_RTIMER21            *((volatile unsigned char*)(0x42A42204UL))
#define bFM4_USB1_HRTIMER2_RTIMER22            *((volatile unsigned char*)(0x42A42208UL))
#define bFM4_USB1_HADR_ADDRESS0                *((volatile unsigned char*)(0x42A42220UL))
#define bFM4_USB1_HADR_ADDRESS1                *((volatile unsigned char*)(0x42A42224UL))
#define bFM4_USB1_HADR_ADDRESS2                *((volatile unsigned char*)(0x42A42228UL))
#define bFM4_USB1_HADR_ADDRESS3                *((volatile unsigned char*)(0x42A4222CUL))
#define bFM4_USB1_HADR_ADDRESS4                *((volatile unsigned char*)(0x42A42230UL))
#define bFM4_USB1_HADR_ADDRESS5                *((volatile unsigned char*)(0x42A42234UL))
#define bFM4_USB1_HADR_ADDRESS6                *((volatile unsigned char*)(0x42A42238UL))
#define bFM4_USB1_HEOF_EOF0                    *((volatile unsigned char*)(0x42A42280UL))
#define bFM4_USB1_HEOF_EOF1                    *((volatile unsigned char*)(0x42A42284UL))
#define bFM4_USB1_HEOF_EOF2                    *((volatile unsigned char*)(0x42A42288UL))
#define bFM4_USB1_HEOF_EOF3                    *((volatile unsigned char*)(0x42A4228CUL))
#define bFM4_USB1_HEOF_EOF4                    *((volatile unsigned char*)(0x42A42290UL))
#define bFM4_USB1_HEOF_EOF5                    *((volatile unsigned char*)(0x42A42294UL))
#define bFM4_USB1_HEOF_EOF6                    *((volatile unsigned char*)(0x42A42298UL))
#define bFM4_USB1_HEOF_EOF7                    *((volatile unsigned char*)(0x42A4229CUL))
#define bFM4_USB1_HEOF_EOF8                    *((volatile unsigned char*)(0x42A422A0UL))
#define bFM4_USB1_HEOF_EOF9                    *((volatile unsigned char*)(0x42A422A4UL))
#define bFM4_USB1_HEOF_EOF10                   *((volatile unsigned char*)(0x42A422A8UL))
#define bFM4_USB1_HEOF_EOF11                   *((volatile unsigned char*)(0x42A422ACUL))
#define bFM4_USB1_HEOF_EOF12                   *((volatile unsigned char*)(0x42A422B0UL))
#define bFM4_USB1_HEOF_EOF13                   *((volatile unsigned char*)(0x42A422B4UL))
#define bFM4_USB1_HEOF_EOF14                   *((volatile unsigned char*)(0x42A422B8UL))
#define bFM4_USB1_HEOF_EOF15                   *((volatile unsigned char*)(0x42A422BCUL))
#define bFM4_USB1_HEOF0_EOF00                  *((volatile unsigned char*)(0x42A42280UL))
#define bFM4_USB1_HEOF0_EOF01                  *((volatile unsigned char*)(0x42A42284UL))
#define bFM4_USB1_HEOF0_EOF02                  *((volatile unsigned char*)(0x42A42288UL))
#define bFM4_USB1_HEOF0_EOF03                  *((volatile unsigned char*)(0x42A4228CUL))
#define bFM4_USB1_HEOF0_EOF04                  *((volatile unsigned char*)(0x42A42290UL))
#define bFM4_USB1_HEOF0_EOF05                  *((volatile unsigned char*)(0x42A42294UL))
#define bFM4_USB1_HEOF0_EOF06                  *((volatile unsigned char*)(0x42A42298UL))
#define bFM4_USB1_HEOF0_EOF07                  *((volatile unsigned char*)(0x42A4229CUL))
#define bFM4_USB1_HEOF1_EOF10                  *((volatile unsigned char*)(0x42A422A0UL))
#define bFM4_USB1_HEOF1_EOF11                  *((volatile unsigned char*)(0x42A422A4UL))
#define bFM4_USB1_HEOF1_EOF12                  *((volatile unsigned char*)(0x42A422A8UL))
#define bFM4_USB1_HEOF1_EOF13                  *((volatile unsigned char*)(0x42A422ACUL))
#define bFM4_USB1_HEOF1_EOF14                  *((volatile unsigned char*)(0x42A422B0UL))
#define bFM4_USB1_HEOF1_EOF15                  *((volatile unsigned char*)(0x42A422B4UL))
#define bFM4_USB1_HFRAME_FRAME0                *((volatile unsigned char*)(0x42A42300UL))
#define bFM4_USB1_HFRAME_FRAME1                *((volatile unsigned char*)(0x42A42304UL))
#define bFM4_USB1_HFRAME_FRAME2                *((volatile unsigned char*)(0x42A42308UL))
#define bFM4_USB1_HFRAME_FRAME3                *((volatile unsigned char*)(0x42A4230CUL))
#define bFM4_USB1_HFRAME_FRAME4                *((volatile unsigned char*)(0x42A42310UL))
#define bFM4_USB1_HFRAME_FRAME5                *((volatile unsigned char*)(0x42A42314UL))
#define bFM4_USB1_HFRAME_FRAME6                *((volatile unsigned char*)(0x42A42318UL))
#define bFM4_USB1_HFRAME_FRAME7                *((volatile unsigned char*)(0x42A4231CUL))
#define bFM4_USB1_HFRAME_FRAME8                *((volatile unsigned char*)(0x42A42320UL))
#define bFM4_USB1_HFRAME_FRAME9                *((volatile unsigned char*)(0x42A42324UL))
#define bFM4_USB1_HFRAME_FRAME10               *((volatile unsigned char*)(0x42A42328UL))
#define bFM4_USB1_HFRAME0_FRAME00              *((volatile unsigned char*)(0x42A42300UL))
#define bFM4_USB1_HFRAME0_FRAME01              *((volatile unsigned char*)(0x42A42304UL))
#define bFM4_USB1_HFRAME0_FRAME02              *((volatile unsigned char*)(0x42A42308UL))
#define bFM4_USB1_HFRAME0_FRAME03              *((volatile unsigned char*)(0x42A4230CUL))
#define bFM4_USB1_HFRAME0_FRAME04              *((volatile unsigned char*)(0x42A42310UL))
#define bFM4_USB1_HFRAME0_FRAME05              *((volatile unsigned char*)(0x42A42314UL))
#define bFM4_USB1_HFRAME0_FRAME06              *((volatile unsigned char*)(0x42A42318UL))
#define bFM4_USB1_HFRAME0_FRAME07              *((volatile unsigned char*)(0x42A4231CUL))
#define bFM4_USB1_HFRAME1_FRAME10              *((volatile unsigned char*)(0x42A42320UL))
#define bFM4_USB1_HFRAME1_FRAME11              *((volatile unsigned char*)(0x42A42324UL))
#define bFM4_USB1_HFRAME1_FRAME12              *((volatile unsigned char*)(0x42A42328UL))
#define bFM4_USB1_HFRAME1_FRAME13              *((volatile unsigned char*)(0x42A4232CUL))
#define bFM4_USB1_HTOKEN_ENDPT0                *((volatile unsigned char*)(0x42A42380UL))
#define bFM4_USB1_HTOKEN_ENDPT1                *((volatile unsigned char*)(0x42A42384UL))
#define bFM4_USB1_HTOKEN_ENDPT2                *((volatile unsigned char*)(0x42A42388UL))
#define bFM4_USB1_HTOKEN_ENDPT3                *((volatile unsigned char*)(0x42A4238CUL))
#define bFM4_USB1_HTOKEN_TKNEN0                *((volatile unsigned char*)(0x42A42390UL))
#define bFM4_USB1_HTOKEN_TKNEN1                *((volatile unsigned char*)(0x42A42394UL))
#define bFM4_USB1_HTOKEN_TKNEN2                *((volatile unsigned char*)(0x42A42398UL))
#define bFM4_USB1_HTOKEN_TGGL                  *((volatile unsigned char*)(0x42A4239CUL))
#define bFM4_USB1_UDCC_PWC                     *((volatile unsigned char*)(0x42A42400UL))
#define bFM4_USB1_UDCC_RFBK                    *((volatile unsigned char*)(0x42A42404UL))
#define bFM4_USB1_UDCC_STALCLREN               *((volatile unsigned char*)(0x42A4240CUL))
#define bFM4_USB1_UDCC_USTP                    *((volatile unsigned char*)(0x42A42410UL))
#define bFM4_USB1_UDCC_HCONX                   *((volatile unsigned char*)(0x42A42414UL))
#define bFM4_USB1_UDCC_RESUM                   *((volatile unsigned char*)(0x42A42418UL))
#define bFM4_USB1_UDCC_RST                     *((volatile unsigned char*)(0x42A4241CUL))
#define bFM4_USB1_EP0C_PKS00                   *((volatile unsigned int*)(0x42A42480UL))
#define bFM4_USB1_EP0C_PKS01                   *((volatile unsigned int*)(0x42A42484UL))
#define bFM4_USB1_EP0C_PKS02                   *((volatile unsigned int*)(0x42A42488UL))
#define bFM4_USB1_EP0C_PKS03                   *((volatile unsigned int*)(0x42A4248CUL))
#define bFM4_USB1_EP0C_PKS04                   *((volatile unsigned int*)(0x42A42490UL))
#define bFM4_USB1_EP0C_PKS05                   *((volatile unsigned int*)(0x42A42494UL))
#define bFM4_USB1_EP0C_PKS06                   *((volatile unsigned int*)(0x42A42498UL))
#define bFM4_USB1_EP0C_STAL                    *((volatile unsigned int*)(0x42A424A4UL))
#define bFM4_USB1_EP1C_PKS10                   *((volatile unsigned int*)(0x42A42500UL))
#define bFM4_USB1_EP1C_PKS11                   *((volatile unsigned int*)(0x42A42504UL))
#define bFM4_USB1_EP1C_PKS12                   *((volatile unsigned int*)(0x42A42508UL))
#define bFM4_USB1_EP1C_PKS13                   *((volatile unsigned int*)(0x42A4250CUL))
#define bFM4_USB1_EP1C_PKS14                   *((volatile unsigned int*)(0x42A42510UL))
#define bFM4_USB1_EP1C_PKS15                   *((volatile unsigned int*)(0x42A42514UL))
#define bFM4_USB1_EP1C_PKS16                   *((volatile unsigned int*)(0x42A42518UL))
#define bFM4_USB1_EP1C_PKS17                   *((volatile unsigned int*)(0x42A4251CUL))
#define bFM4_USB1_EP1C_PKS18                   *((volatile unsigned int*)(0x42A42520UL))
#define bFM4_USB1_EP1C_STAL                    *((volatile unsigned int*)(0x42A42524UL))
#define bFM4_USB1_EP1C_NULE                    *((volatile unsigned int*)(0x42A42528UL))
#define bFM4_USB1_EP1C_DMAE                    *((volatile unsigned int*)(0x42A4252CUL))
#define bFM4_USB1_EP1C_DIR                     *((volatile unsigned int*)(0x42A42530UL))
#define bFM4_USB1_EP1C_TYPE0                   *((volatile unsigned int*)(0x42A42534UL))
#define bFM4_USB1_EP1C_TYPE1                   *((volatile unsigned int*)(0x42A42538UL))
#define bFM4_USB1_EP1C_EPEN                    *((volatile unsigned int*)(0x42A4253CUL))
#define bFM4_USB1_EP2C_PKS20                   *((volatile unsigned int*)(0x42A42580UL))
#define bFM4_USB1_EP2C_PKS21                   *((volatile unsigned int*)(0x42A42584UL))
#define bFM4_USB1_EP2C_PKS22                   *((volatile unsigned int*)(0x42A42588UL))
#define bFM4_USB1_EP2C_PKS23                   *((volatile unsigned int*)(0x42A4258CUL))
#define bFM4_USB1_EP2C_PKS24                   *((volatile unsigned int*)(0x42A42590UL))
#define bFM4_USB1_EP2C_PKS25                   *((volatile unsigned int*)(0x42A42594UL))
#define bFM4_USB1_EP2C_PKS26                   *((volatile unsigned int*)(0x42A42598UL))
#define bFM4_USB1_EP2C_STAL                    *((volatile unsigned int*)(0x42A425A4UL))
#define bFM4_USB1_EP2C_NULE                    *((volatile unsigned int*)(0x42A425A8UL))
#define bFM4_USB1_EP2C_DMAE                    *((volatile unsigned int*)(0x42A425ACUL))
#define bFM4_USB1_EP2C_DIR                     *((volatile unsigned int*)(0x42A425B0UL))
#define bFM4_USB1_EP2C_TYPE0                   *((volatile unsigned int*)(0x42A425B4UL))
#define bFM4_USB1_EP2C_TYPE1                   *((volatile unsigned int*)(0x42A425B8UL))
#define bFM4_USB1_EP2C_EPEN                    *((volatile unsigned int*)(0x42A425BCUL))
#define bFM4_USB1_EP3C_PKS30                   *((volatile unsigned int*)(0x42A42600UL))
#define bFM4_USB1_EP3C_PKS31                   *((volatile unsigned int*)(0x42A42604UL))
#define bFM4_USB1_EP3C_PKS32                   *((volatile unsigned int*)(0x42A42608UL))
#define bFM4_USB1_EP3C_PKS33                   *((volatile unsigned int*)(0x42A4260CUL))
#define bFM4_USB1_EP3C_PKS34                   *((volatile unsigned int*)(0x42A42610UL))
#define bFM4_USB1_EP3C_PKS35                   *((volatile unsigned int*)(0x42A42614UL))
#define bFM4_USB1_EP3C_PKS36                   *((volatile unsigned int*)(0x42A42618UL))
#define bFM4_USB1_EP3C_STAL                    *((volatile unsigned int*)(0x42A42624UL))
#define bFM4_USB1_EP3C_NULE                    *((volatile unsigned int*)(0x42A42628UL))
#define bFM4_USB1_EP3C_DMAE                    *((volatile unsigned int*)(0x42A4262CUL))
#define bFM4_USB1_EP3C_DIR                     *((volatile unsigned int*)(0x42A42630UL))
#define bFM4_USB1_EP3C_TYPE0                   *((volatile unsigned int*)(0x42A42634UL))
#define bFM4_USB1_EP3C_TYPE1                   *((volatile unsigned int*)(0x42A42638UL))
#define bFM4_USB1_EP3C_EPEN                    *((volatile unsigned int*)(0x42A4263CUL))
#define bFM4_USB1_EP4C_PKS40                   *((volatile unsigned int*)(0x42A42680UL))
#define bFM4_USB1_EP4C_PKS41                   *((volatile unsigned int*)(0x42A42684UL))
#define bFM4_USB1_EP4C_PKS42                   *((volatile unsigned int*)(0x42A42688UL))
#define bFM4_USB1_EP4C_PKS43                   *((volatile unsigned int*)(0x42A4268CUL))
#define bFM4_USB1_EP4C_PKS44                   *((volatile unsigned int*)(0x42A42690UL))
#define bFM4_USB1_EP4C_PKS45                   *((volatile unsigned int*)(0x42A42694UL))
#define bFM4_USB1_EP4C_PKS46                   *((volatile unsigned int*)(0x42A42698UL))
#define bFM4_USB1_EP4C_STAL                    *((volatile unsigned int*)(0x42A426A4UL))
#define bFM4_USB1_EP4C_NULE                    *((volatile unsigned int*)(0x42A426A8UL))
#define bFM4_USB1_EP4C_DMAE                    *((volatile unsigned int*)(0x42A426ACUL))
#define bFM4_USB1_EP4C_DIR                     *((volatile unsigned int*)(0x42A426B0UL))
#define bFM4_USB1_EP4C_TYPE0                   *((volatile unsigned int*)(0x42A426B4UL))
#define bFM4_USB1_EP4C_TYPE1                   *((volatile unsigned int*)(0x42A426B8UL))
#define bFM4_USB1_EP4C_EPEN                    *((volatile unsigned int*)(0x42A426BCUL))
#define bFM4_USB1_EP5C_PKS50                   *((volatile unsigned int*)(0x42A42700UL))
#define bFM4_USB1_EP5C_PKS51                   *((volatile unsigned int*)(0x42A42704UL))
#define bFM4_USB1_EP5C_PKS52                   *((volatile unsigned int*)(0x42A42708UL))
#define bFM4_USB1_EP5C_PKS53                   *((volatile unsigned int*)(0x42A4270CUL))
#define bFM4_USB1_EP5C_PKS54                   *((volatile unsigned int*)(0x42A42710UL))
#define bFM4_USB1_EP5C_PKS55                   *((volatile unsigned int*)(0x42A42714UL))
#define bFM4_USB1_EP5C_PKS56                   *((volatile unsigned int*)(0x42A42718UL))
#define bFM4_USB1_EP5C_STAL                    *((volatile unsigned int*)(0x42A42724UL))
#define bFM4_USB1_EP5C_NULE                    *((volatile unsigned int*)(0x42A42728UL))
#define bFM4_USB1_EP5C_DMAE                    *((volatile unsigned int*)(0x42A4272CUL))
#define bFM4_USB1_EP5C_DIR                     *((volatile unsigned int*)(0x42A42730UL))
#define bFM4_USB1_EP5C_TYPE0                   *((volatile unsigned int*)(0x42A42734UL))
#define bFM4_USB1_EP5C_TYPE1                   *((volatile unsigned int*)(0x42A42738UL))
#define bFM4_USB1_EP5C_EPEN                    *((volatile unsigned int*)(0x42A4273CUL))
#define bFM4_USB1_TMSP_TMSP0                   *((volatile unsigned int*)(0x42A42780UL))
#define bFM4_USB1_TMSP_TMSP1                   *((volatile unsigned int*)(0x42A42784UL))
#define bFM4_USB1_TMSP_TMSP2                   *((volatile unsigned int*)(0x42A42788UL))
#define bFM4_USB1_TMSP_TMSP3                   *((volatile unsigned int*)(0x42A4278CUL))
#define bFM4_USB1_TMSP_TMSP4                   *((volatile unsigned int*)(0x42A42790UL))
#define bFM4_USB1_TMSP_TMSP5                   *((volatile unsigned int*)(0x42A42794UL))
#define bFM4_USB1_TMSP_TMSP6                   *((volatile unsigned int*)(0x42A42798UL))
#define bFM4_USB1_TMSP_TMSP7                   *((volatile unsigned int*)(0x42A4279CUL))
#define bFM4_USB1_TMSP_TMSP8                   *((volatile unsigned int*)(0x42A427A0UL))
#define bFM4_USB1_TMSP_TMSP9                   *((volatile unsigned int*)(0x42A427A4UL))
#define bFM4_USB1_TMSP_TMSP10                  *((volatile unsigned int*)(0x42A427A8UL))
#define bFM4_USB1_UDCS_CONF                    *((volatile unsigned char*)(0x42A42800UL))
#define bFM4_USB1_UDCS_SETP                    *((volatile unsigned char*)(0x42A42804UL))
#define bFM4_USB1_UDCS_WKUP                    *((volatile unsigned char*)(0x42A42808UL))
#define bFM4_USB1_UDCS_BRST                    *((volatile unsigned char*)(0x42A4280CUL))
#define bFM4_USB1_UDCS_SOF                     *((volatile unsigned char*)(0x42A42810UL))
#define bFM4_USB1_UDCS_SUSP                    *((volatile unsigned char*)(0x42A42814UL))
#define bFM4_USB1_UDCIE_CONFIE                 *((volatile unsigned char*)(0x42A42820UL))
#define bFM4_USB1_UDCIE_CONFN                  *((volatile unsigned char*)(0x42A42824UL))
#define bFM4_USB1_UDCIE_WKUPIE                 *((volatile unsigned char*)(0x42A42828UL))
#define bFM4_USB1_UDCIE_BRSTIE                 *((volatile unsigned char*)(0x42A4282CUL))
#define bFM4_USB1_UDCIE_SOFIE                  *((volatile unsigned char*)(0x42A42830UL))
#define bFM4_USB1_UDCIE_SUSPIE                 *((volatile unsigned char*)(0x42A42834UL))
#define bFM4_USB1_EP0IS_DRQI                   *((volatile unsigned int*)(0x42A428A8UL))
#define bFM4_USB1_EP0IS_DRQIIE                 *((volatile unsigned int*)(0x42A428B8UL))
#define bFM4_USB1_EP0IS_BFINI                  *((volatile unsigned int*)(0x42A428BCUL))
